[
  {
    "Id": "4248904997",
    "CompanyName": "Motorola Solutions",
    "JobOfferTitle": "Senior Software Developer experienced in .NET \u0026 Azure Cloud development in C#",
    "JobOfferSummarize": "Motorola Solutions is seeking a Senior Software Developer with expertise in .NET and Azure Cloud development in C#. The role involves creating cutting-edge web applications, peer code reviews, mentoring, and collaborating with UX and test teams. The candidate must have strong experience in C#, .NET Web Applications, and cloud development.",
    "EmailContact": "Not provided",
    "ContactHiringSection": "Not provided",
    "KeySkillsRequired": [
      {
        "Name": "C#",
        "RelevancePercentage": 30
      },
      {
        "Name": ".NET",
        "RelevancePercentage": 25
      },
      {
        "Name": "Azure Cloud",
        "RelevancePercentage": 20
      },
      {
        "Name": "Web Applications",
        "RelevancePercentage": 15
      },
      {
        "Name": "Microservices",
        "RelevancePercentage": 10
      }
    ],
    "EssentialQualifications": [
      {
        "Name": "Bachelor’s degree in Computer Science or a related technical discipline",
        "RelevancePercentage": 30
      },
      {
        "Name": "5\u002B years of experience writing in a C# or similar language",
        "RelevancePercentage": 40
      },
      {
        "Name": "5\u002B years of experience building and maintaining .NET Web Applications",
        "RelevancePercentage": 30
      }
    ],
    "EssentialTechnicalSkillQualifications": [
      {
        "Name": "Solid understanding of data structures, asynchronous architectures and building data-intensive applications",
        "RelevancePercentage": 25
      },
      {
        "Name": "Experience with developing cloud applications",
        "RelevancePercentage": 20
      },
      {
        "Name": "Experience with managing cloud resources and building CI/CD pipelines",
        "RelevancePercentage": 20
      },
      {
        "Name": "Experience designing and building microservices",
        "RelevancePercentage": 20
      },
      {
        "Name": "Experience developing RESTful API\u0027s used with web browsers, backend servers, or mobile applications",
        "RelevancePercentage": 15
      }
    ],
    "OtherTechnicalSkillQualifications": [
      {
        "Name": "Excellent written and oral communication skills, including the ability to produce clear, concise documentation",
        "RelevancePercentage": 70
      },
      {
        "Name": "Experience with React",
        "RelevancePercentage": 15
      },
      {
        "Name": "Experience with AI/machine learning technologies",
        "RelevancePercentage": 15
      }
    ],
    "SalaryOrBudgetOffered": "62,600 - 130,000 CAD depending on experience",
    "Description": "The Senior Software Developer will be responsible for creating cutting-edge web applications, peer code reviews, mentoring, and collaborating with UX and test teams. The role requires expertise in C#, .NET Web Applications, and cloud development. The candidate must have strong communication skills and experience with microservices and RESTful APIs. The position is based in Vancouver, BC, with a hybrid work schedule.",
    "Url": "https://www.linkedin.com/jobs/view/4248904997/",
    "RawJobDescription": [
      "About the job",
      "Company Overview",
      "",
      "At Motorola Solutions, we believe that everything starts with our people. We’re a global close-knit community, united by the relentless pursuit to help keep people safer everywhere. Our critical communications, video security and command center technologies support public safety agencies and enterprises alike, enabling the coordination that’s critical for safer communities, safer schools, safer hospitals and safer businesses. Connect with a career that matters, and help us build a safer future.",
      "Aperçu de l’entreprise",
      "Chez Motorola Solutions, nous pensons que tout commence par nos employés. Nous sommes une communauté mondiale soudée, unie par la volonté incessante de contribuer à la sécurité des personnes partout dans le monde. Nos technologies de communication, de sécurité vidéo et de centre de commandement essentielles soutiennent les agences de sécurité publique et les entreprises, permettant une coordination essentielle pour des communautés, des écoles, des hôpitaux et des entreprises plus sécuritaires. Connectez-vous à une carrière qui compte et aidez-nous à bâtir un avenir plus sûr.",
      "Department Overview",
      "Motorola Solution’s Video Division is defining the future of the security industry through innovative end-to-end-solutions. We’re changing the landscape of the surveillance industry through advanced award-winning AI based surveillance systems. Artificial Intelligence is transforming the world and our team is advancing the field as it applies to the surveillance industry. We are proud to be industry leaders in video analytics with products like Appearance Search and Unusual Motion Detection along with our recently launched Avigilon cloud service platform. You will have the opportunity to contribute to intelligent camera surveillance systems through cutting edge research and software engineering.",
      "Job Description",
      "We are seeking a Senior Software Developer experienced in .NET \u0026 Azure Cloud development in C#.",
      "Responsibilities include:",
      "Create cutting edge web applications. Candidates should feel comfortable transitioning from back end web projects along and desktop projects. ",
      "Regardless of tech stack, candidate should be focused on usability, responsiveness, scalability, testability and best coding and design practices",
      "Peer review code for adherence to coding standards and design guidelines",
      "Mentoring peers and scrum team building",
      "Collaborate with UX and visual designers on proposed designs",
      "Collaborate with the Automation and Test team on identifying test cases for new features and regression testing",
      "Build and deploy your microservices in Kubernetes",
      "Qualifications:",
      "Bachelor’s degree in Computer Science or a related technical discipline",
      "5\u002B years of experience writing in a C# or similar language",
      "5\u002B years of experience building and maintaining .NET Web Applications",
      "Solid understanding of data structures, asynchronous architectures and building data-intensive applications",
      "Experience with developing cloud applications",
      "You are equally excited to build a minimum viable product as you are cementing a feature in maintainable and tested code",
      "Excellent written and oral communication skills, including the ability to produce clear, concise documentation",
      "Experience with managing cloud resources and building CI/CD pipelines",
      "Experience designing and building microservices",
      "Experience developing RESTful API\u0027s used with web browsers, backend servers, or mobile applications",
      "Nice to have:",
      "Experience with React",
      "Experience with AI/machine learning technologies is strongly preferred",
      "This position is based in Vancouver, BC and the candidate must reside in the Greater Vancouver Area as you will be required to go into the office on a hybrid work schedule.",
      "The base salary for this position in British Columbia is 62,600 - 130,000 CAD depending on experience.",
      "Basic Requirements",
      "Bachelors Degree",
      "4\u002B years of software development experience",
      "Travel Requirements",
      "Under 10%",
      "Relocation Provided",
      "None",
      "Position Type",
      "Experienced",
      "Referral Payment Plan",
      "Yes",
      "EEO Statement",
      "Motorola Solutions is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion or belief, sex, sexual orientation, gender identity, national origin, disability, veteran status or any other legally-protected characteristic.",
      "We are proud of our people-first and community-focused culture, empowering every Motorolan to be their most authentic self and to do their best work to deliver on the promise of a safer world. If you’d like to join our team but feel that you don’t quite meet all of the preferred skills, we’d still love to hear why you think you’d be a great addition to our team.",
      "We’re committed to providing an inclusive and accessible recruiting experience for candidates with disabilities, or other physical or mental health conditions. To request an accommodation, please complete this Reasonable Accommodations Form so we can assist you.",
      "Motorola Solutions adopte, favorise et promeut les principes de diversité, d’équité et d’inclusion. Nous encourageons et accueillons les candidatures de toutes les personnes qualifiées, quelles que soient leur race, origines ethnique, religion ou croyance, orientation sexuelle, identité et expression sexuelle, statut d’anciens combattants ou tout autre statut protégé par la Loi.",
      "Nous sommes fiers de notre culture axée sur les personnes et les communautés, encourageant ainsi chaque Motorolan d’être la version la plus authentique de lui-même dans ses responsabilités afin de tenir la promesse d’un monde plus sécuritaire.",
      "Si vous souhaitez vous joindre à notre communauté mais croyez que vous ne possédez pas toutes les exigences requises pour le poste convoité, nous aimerions tout de même connaître les raisons pour lesquelles vous pensez être un excellent candidat pour notre équipe.",
      "Nous offrons également des mesures d’adaptation pendant toutes les étapes du processus d’embauche afin de favoriser l’inclusion des personnes vivant avec un handicap physique et/ou mental. Pour demander un aménagement, veuillez remplir ce formulaire d\u0027aménagement raisonnable afin que nous puissions vous aider."
    ]
  },
  {
    "Id": "4256084193",
    "CompanyName": "Global Relay",
    "JobOfferTitle": "Intermediate C# Developer",
    "JobOfferSummarize": "As an Intermediate C# Developer at Global Relay, you’ll use leading-edge technologies to build pioneering products for global users. You will tackle scalability and high availability challenges in big data environments, working alongside top C# developers in an agile, collaborative environment.",
    "EmailContact": "Not provided",
    "ContactHiringSection": "Not provided",
    "KeySkillsRequired": [
      {
        "Name": "C#",
        "RelevancePercentage": 40
      },
      {
        "Name": "Multi-threaded programming",
        "RelevancePercentage": 20
      },
      {
        "Name": "Agile methodologies",
        "RelevancePercentage": 15
      },
      {
        "Name": "Test-driven development",
        "RelevancePercentage": 10
      },
      {
        "Name": "Service-oriented architecture",
        "RelevancePercentage": 10
      },
      {
        "Name": "Object-relational mapping",
        "RelevancePercentage": 5
      }
    ],
    "EssentialQualifications": [
      {
        "Name": "Minimum 5 years of C# developer experience",
        "RelevancePercentage": 50
      },
      {
        "Name": "Experience with multi-threaded programming and design patterns",
        "RelevancePercentage": 30
      },
      {
        "Name": "Experience with agile development methodologies",
        "RelevancePercentage": 20
      }
    ],
    "EssentialTechnicalSkillQualifications": [
      {
        "Name": "Experience with test driven development, continuous integration systems, and dependency injection containers",
        "RelevancePercentage": 30
      },
      {
        "Name": "Experience with network protocols such as HTTP, TLS, TCP",
        "RelevancePercentage": 25
      },
      {
        "Name": "Experience with service-oriented architecture including Thrift, REST, and JSON",
        "RelevancePercentage": 25
      },
      {
        "Name": "Experience with object relational mapping architecture including T-SQL, NHibernate, Entity Framework",
        "RelevancePercentage": 20
      }
    ],
    "OtherTechnicalSkillQualifications": [
      {
        "Name": "Strong communication skills",
        "RelevancePercentage": 70
      },
      {
        "Name": "Self-motivated and independent",
        "RelevancePercentage": 30
      }
    ],
    "SalaryOrBudgetOffered": "$80,000—$100,000 CAD",
    "Description": "The Intermediate C# Developer will work on enterprise services using C#, collaborate with agile teams, and design software implementations. Responsibilities include writing unit tests, developing deployment systems, and supporting production operations. The role requires 5\u002B years of C# experience and expertise in multi-threaded programming, agile methodologies, and service-oriented architecture.",
    "Url": "https://www.linkedin.com/jobs/view/4256084193/",
    "RawJobDescription": [
      "About the job",
      "Who we are:",
      "",
      "For over 20 years, Global Relay has set the standard in enterprise information archiving with industry-leading cloud archiving, surveillance, eDiscovery, and analytics solutions. We securely capture and preserve the communications data of the world’s most highly regulated firms, giving them greater visibility and control over their information and ensuring compliance with stringent regulations.",
      "Though we offer competitive compensation and benefits and all the other perks one would expect from an established company, we are not your typical technology company. Global Relay is a career-building company. A place for big ideas. New challenges. Groundbreaking innovation. It’s a place where you can genuinely make an impact – and be recognized for it.",
      "We believe great businesses thrive on diversity, inclusion, and the contributions of all employees. To that end, we recruit candidates from different backgrounds and foster a work environment that encourages employees to collaborate and learn from each other, completely free of barriers.",
      "Your role:",
      "As an Intermediate C# Developer at Global Relay, you’ll be using leading edge technologies to build pioneering products that are used by tens of thousands of users globally to solve real world business problems. You will tackle interesting and engaging problems regarding scalability and high availability in big data environments. At Global Relay we are continuously pushing the boundaries of C# technology.",
      "This is an opportunity to work alongside some of the best C# developers in Vancouver and apply your craft in an environment that encourages creative thinking and autonomy. Our software is developed by small, focused, and agile teams of developers and QA. We encourage our developers to think beyond a single component to build complete system solutions. Challenge yourself by learning new technologies, and apply your skills across our different projects and application domains. If you are committed to code that is clean, well-tested, well-reviewed, performant, and secure then you’ll fit in around here.",
      "Your responsibilities:",
      "Work as part of an agile development team to write C# code for enterprise services",
      "Write unit and integration tests for your C# code",
      "Design, in collaboration with team, the software implementations that satisfy business requirements",
      "Collaborate with QA in development of test cases for C# code",
      "Develop deployment systems for C# based systems",
      "Document code and document detail designs",
      "Collaborate with product owners on user story generation and refinement",
      "Monitor and support operation of production systems",
      "Participate in knowledge sharing activities with colleagues",
      "About you:",
      "Minimum 5 years of C# developer experience",
      "Experience with multi-threaded programming and design patterns",
      "Experience with Java or another OOP language is an asset",
      "Experience with agile development methodologies",
      "Experience with test driven development, continuous integration systems, and dependency injection containers",
      "Experience with network protocols such as HTTP, TLS, TCP",
      "Experience with service-oriented architecture including Thrift, REST, and JSON",
      "Experience with object relational mapping architecture including T-SQL, NHibernate, Entity Framework",
      "Compensation:",
      "Global Relay advertises the pay range for this role in compliance with British Columbia’s pay transparency laws. Individual pay rates are determined by evaluating factors such as expertise, skills, education, and professional background.",
      "The range below reflects the expected annual base salary, which is only one element of our comprehensive total rewards package designed to reflect our company pay philosophy, culture and values. We aim to foster an inspiring work environment and support employees\u0027 work-life rhythms. We provide a comprehensive extended health benefits program, including virtual healthcare and a wellness allowance. Employees also receive annual allotted vacation days, which increase based on tenure. Other benefits include: Paid sick days, maternity/parental enhancement program, corporate bonuses, and an RRSP contribution matching program.",
      "For Vancouver-based employees, we provide a subsidized meal program, courtesy of our talented in-house culinary team!",
      "British Columbia - Base Salary Range:",
      "$80,000—$100,000 CAD",
      "What you can expect:",
      "At Global Relay, there’s no ceiling to what you can achieve. It’s the land of opportunity for the energetic, the intelligent, the driven. You’ll receive the mentoring, coaching, and support you need to reach your career goals. You’ll be part of a culture that breeds creativity and rewards perseverance and hard work. And you’ll be working alongside smart, talented individuals from diverse backgrounds, with complementary knowledge and skills.",
      "Global Relay is an equal-opportunity employer committed to diversity, equity, and inclusion.",
      "We seek to ensure reasonable adjustments, accommodations, and personal time are tailored to meet the unique needs of every individual.",
      "We understand flexible work arrangements are important, and we encourage that in our work culture. Whether it’s flexibility around work hours, workstyle, or lifestyle, we want to ensure our employees have a healthy work/life balance. We support and value a hybrid work model that blends collaboration with the team in the office and focus time from the comfort of your home.",
      "To learn more about our business, culture, and community involvement, visit www.globalrelay.com."
    ]
  },
  {
    "Id": "4188413939",
    "CompanyName": "Corpay",
    "JobOfferTitle": "Senior Fullstack .NET Developer",
    "JobOfferSummarize": "Corpay is seeking a Senior Fullstack .NET Developer to join their Buyatab division in Vancouver, Canada. The role involves providing technical direction, leading projects, and architecting code while working in a hybrid environment. The ideal candidate will have extensive experience with C#, .NET, JavaScript, and Agile methodologies.",
    "EmailContact": "Not provided",
    "ContactHiringSection": "Not provided",
    "KeySkillsRequired": [
      {
        "Name": "C#",
        "RelevancePercentage": 30
      },
      {
        "Name": ".NET",
        "RelevancePercentage": 25
      },
      {
        "Name": "JavaScript",
        "RelevancePercentage": 15
      },
      {
        "Name": "ASP.NET",
        "RelevancePercentage": 10
      },
      {
        "Name": "React",
        "RelevancePercentage": 10
      },
      {
        "Name": "SQL Server",
        "RelevancePercentage": 10
      }
    ],
    "EssentialQualifications": [
      {
        "Name": "8\u002B years of experience using C#, Javascript and debugging techniques",
        "RelevancePercentage": 50
      },
      {
        "Name": "B.S./M.S. in Computer Science or equivalent experience",
        "RelevancePercentage": 30
      },
      {
        "Name": "Experience with .NET Full Framework (4.0–4.8) and .NET (2.2–7.0)",
        "RelevancePercentage": 20
      }
    ],
    "EssentialTechnicalSkillQualifications": [
      {
        "Name": "Expert in HTML/CSS/JavaScript and web protocols",
        "RelevancePercentage": 30
      },
      {
        "Name": "Experience with React/Redux/KnockoutJS",
        "RelevancePercentage": 25
      },
      {
        "Name": "SQL Server/MongoDB proficiency",
        "RelevancePercentage": 20
      },
      {
        "Name": "Knowledge of OOP, modular design, and CI/CD",
        "RelevancePercentage": 15
      },
      {
        "Name": "Scrum/Agile experience",
        "RelevancePercentage": 10
      }
    ],
    "OtherTechnicalSkillQualifications": [
      {
        "Name": "Strong communication skills",
        "RelevancePercentage": 70
      },
      {
        "Name": "Self-motivated and works with minimal supervision",
        "RelevancePercentage": 30
      }
    ],
    "SalaryOrBudgetOffered": "$115,000 -$125,000 per annum",
    "Description": "The Senior Fullstack .NET Developer will provide technical direction, lead projects, and architect code while working in a hybrid environment. Responsibilities include designing complex transaction control systems, refactoring legacy applications, and integrating with third-party web services. The role requires expertise in C#, .NET, JavaScript, and Agile methodologies, along with strong communication skills and self-motivation.",
    "Url": "https://www.linkedin.com/jobs/view/4188413939/",
    "RawJobDescription": [
      "About the job",
      "What We Need",
      "",
      "Corpay is currently looking to hire a Senior Fullstack .NET Developer within our Buyatab division. This position falls under our SVS (Stored Value Solutions) line of business and is located in Vancouver, Canada. In the role, the Senior Fullstack .NET Developer will have a wealth of hands-on experience using C# and .NET technologies. You are passionate about agile methodology, and want to contribute to a fast paced, highly collaborative Scrum team. You love learning, being challenged, and challenging others to grow and improve. You bring creative ideas and novel approaches to solving problems.",
      "How We Work",
      "As a Senior Fullstack .NET Developer, you will be expected to work in a hybrid environment at our Vancouver, Canada office location. Corpay will set you up for success by providing:",
      " Company-issued equipment ",
      " Assigned workspace in a hybrid environment ",
      " Formal, hands-on training ",
      "Role Responsibilities",
      " Providing technical direction, planning, and vision to development team members. ",
      " As a lead programmer on new projects, creating, maintaining, and owning technical specifications, designs, and schedules with little direction from manager ",
      " Forging strong relationships across departments and to other companies. Communicates programming needs and interests to product team and others. ",
      " Anticipating and acts upon issues and problems that arise, providing alternative approaches and solutions. ",
      " Architecting and implementing significant portions of code, leveraging work across more than one product. ",
      " Seeking out new tools and techniques to facilitate work. ",
      " Insisting on highest quality in own work and that of others. ",
      " Designing and implementing complex transaction control systems involving secure web application development and integrating with third party web services ",
      " Refactoring and migrating legacy applications to distributed application architecture in AWS cloud ",
      " Leading by example ",
      "Qualifications \u0026 Skills",
      " 8\u002B years of experience using C#, Javascript and debugging techniques for developing ASP.Net, Asp.Net Core applications ",
      " B.S./M.S. in Computer Science, experience in developing two or more commercially used applications, or equivalent experience ",
      " Experience building applications using .Net Full Framework (4.0 – 4.8) and .Net (2.2 – 7.0) ",
      " Expert in using web technologies, such as HTML, CSS, Javascript, Internet technologies, communication protocols, and techniques ",
      " Experience in building applications using React, Redux / Flux, KnockoutJS ",
      " Experience with database methodologies and database systems including SQL Server and MongoDB. ",
      " Has knowledge of current software design practices, including modularity, event-driven architecture, object-oriented design, interface design, localization, portability, extensibility, and testability ",
      " Has experience working in a Scrum / Agile development environment with great understanding of CI / CD practices ",
      " Has good communication skills ",
      " Self-motivated and works with minimal supervision ",
      "This salary range is provided for locations which require such disclosure. Where a position or applicant may fall in a particular wage range varies depending on a number of factors, including but not limited to skill sets, experience, training, licensure and certifications (if applicable), and other business and organization needs. The disclosed range has not been adjusted for the applicable geographic markets. At Corpay, it is not typical for an individual to be hired at or near the top of the range for their role, and compensation decisions are dependent on the facts and circumstances of each case. An estimate of the minimum and maximum salary range is $115,000 -$125,000 per annum.",
      "Benefits \u0026 Perks",
      " Comprehensive Benefits Package including, Medical, Dental, Vision and Paramedical benefits, as of day one ",
      " Optional company match RRSP program ",
      " Virtual fitness classes offered company-wide ",
      " Time-off including major holidays, vacation, sick, personal, \u0026 volunteer time ",
      " Discounted gym membership rate ",
      " Philanthropic support with both local and national organizations ",
      " Fun culture with company-wide contests and prizes ",
      "Our Company \u0026 Purpose",
      "Corpay is a global leader in business payments, laser focused on developing smarter ways for businesses to pay their expenses. Since 2000, Corpay has developed innovative digital solutions that help businesses better track, manage, and pay their expenses. Today, Corpay is an S\u0026P 500 company with hundreds of thousands of customers using our products in over 100 countries. Companies of all sizes, industries and geographies rely on our product portfolio to manage spending more quickly, efficiently and securely than ever before.",
      "We embrace a culture grounded in five key values: integrity, collaboration, innovation, execution and people. These values offer you the opportunity to ‘thrive \u0026 grow’ through career development, volunteer, community, and wellness initiatives. This allows you to create a balance between professional goals and personal achievement.",
      "Corpay is also committed to building and nurturing a culture of diversity, inclusion, equality, and belonging by:",
      " Welcoming people of different backgrounds, cultures, ethnicities, genders, and sexual orientations; ",
      " Empowering our people to share their experiences and ideas through open forums and individual conversations; and ",
      " Valuing each person’s unique perspectives and individual contributions. ",
      "Embracing diversity enables our people to “make the difference” as Corpay and its more than 8,000 employees continue to shape the future of global payments. Learn more by visiting www.corpay.com or following Corpay on LinkedIn .",
      " Equal Opportunity/Affirmative Action Employer ",
      "Corpay is an Equal Opportunity Employer. Corpay provides equal employment opportunities to all employees and applicants without regard to race, color, gender (including pregnancy), religion, national origin, ancestry, disability, age, sexual orientation, gender identity or expression, marital status, language, ancestry, genetic information, veteran and/or military status or any other group status protected by federal or local law. If you require reasonable accommodation for the application and/or interview process, please notify a representative of the Human Resources Department.",
      " For more information about our commitment to equal employment opportunity and pay transparency, please click the following links: EEO and Pay Transparency ",
      "Apply Now"
    ]
  },
  {
    "Id": "4253874873",
    "CompanyName": "Corpay",
    "JobOfferTitle": "Senior Full .NET Stack Developer",
    "JobOfferSummarize": "Corpay is seeking a Senior Full .NET Stack Developer to join their Buyatab division in Vancouver. The role involves providing technical direction, leading projects, and architecting code. The ideal candidate will have extensive experience with C#, .NET, and JavaScript, and thrive in a Scrum/Agile environment.",
    "EmailContact": "Not provided",
    "ContactHiringSection": "Not provided",
    "KeySkillsRequired": [
      {
        "Name": "C#",
        "RelevancePercentage": 30
      },
      {
        "Name": ".NET",
        "RelevancePercentage": 25
      },
      {
        "Name": "JavaScript",
        "RelevancePercentage": 15
      },
      {
        "Name": "ASP.NET",
        "RelevancePercentage": 10
      },
      {
        "Name": "React",
        "RelevancePercentage": 10
      },
      {
        "Name": "SQL Server",
        "RelevancePercentage": 10
      }
    ],
    "EssentialQualifications": [
      {
        "Name": "8\u002B years of experience using C#, Javascript and debugging techniques",
        "RelevancePercentage": 50
      },
      {
        "Name": "B.S./M.S. in Computer Science or equivalent experience",
        "RelevancePercentage": 30
      },
      {
        "Name": "Experience with .NET Full Framework (4.0–4.8) and .NET (2.2–7.0)",
        "RelevancePercentage": 20
      }
    ],
    "EssentialTechnicalSkillQualifications": [
      {
        "Name": "Expert in HTML/CSS/JavaScript and web protocols",
        "RelevancePercentage": 30
      },
      {
        "Name": "Experience with React/Redux/KnockoutJS",
        "RelevancePercentage": 25
      },
      {
        "Name": "SQL Server/MongoDB proficiency",
        "RelevancePercentage": 20
      },
      {
        "Name": "Knowledge of OOP, modular design, and CI/CD",
        "RelevancePercentage": 15
      },
      {
        "Name": "Scrum/Agile experience",
        "RelevancePercentage": 10
      }
    ],
    "OtherTechnicalSkillQualifications": [
      {
        "Name": "Strong communication skills",
        "RelevancePercentage": 70
      },
      {
        "Name": "Self-motivated and independent",
        "RelevancePercentage": 30
      }
    ],
    "SalaryOrBudgetOffered": "$110,000 -$125,000 CAD annually",
    "Description": "The Senior Full .NET Stack Developer will provide technical direction, lead projects, and architect code. Responsibilities include designing complex transaction control systems, refactoring legacy applications, and integrating with third-party services. The role requires expertise in C#, .NET, JavaScript, and experience with Scrum/Agile methodologies.",
    "Url": "https://www.linkedin.com/jobs/view/4253874873/",
    "RawJobDescription": [
      "About the job",
      "Vancouver, BC, Canada Req #10490",
      "",
      "Tuesday, December 17, 2024",
      "What We Need",
      "Corpay is currently looking to hire a Senior Full .NET Stack Developer within our Buyatab division. This position falls under our SVS (Stored Value Solutions) line of business and is located in Vancouver, Canada. In the role, the Senior Full .NET Stack Developer will have a wealth of hands-on experience using C# and .NET technologies. You are passionate about agile methodology, and want to contribute to a fast paced, highly collaborative Scrum team. You love learning, being challenged, and challenging others to grow and improve. You bring creative ideas and novel approaches to solving problems.",
      "How We Work",
      "As a Senior Full .NET Stack Developer, you will be expected to work in a hybrid environment reporting our Vancouver, Canada office location. Corpay will set you up for success by providing:",
      "Company-issued equipment",
      "Assigned workspace in a hybrid environment",
      "Formal, hands-on training",
      "Monthly home internet stipend",
      "Role Responsibilities",
      "The responsibilities of the role will include:",
      "Providing technical direction, planning, and vision to development team members. ",
      "As a lead programmer on new projects, creating, maintaining, and owning technical specifications, designs, and schedules with little direction from manager ",
      "Forging strong relationships across departments and to other companies. Communicates programming needs and interests to product team and others.",
      "Anticipating and acts upon issues and problems that arise, providing alternative approaches and solutions.",
      "Architecting and implementing significant portions of code, leveraging work across more than one product. ",
      "Seeking out new tools and techniques to facilitate work. ",
      "Insisting on highest quality in own work and that of others. ",
      "Designing and implementing complex transaction control systems involving secure web application development and integrating with third party web services",
      "Refactoring and migrating legacy applications to distributed application architecture in AWS cloud",
      "Leading by example",
      "Qualifications \u0026 Skills",
      "8\u002B years of experience using C#, Javascript and debugging techniques for developing ASP.Net, Asp.Net Core applications",
      "B.S./M.S. in Computer Science, experience in developing two or more commercially used applications, or equivalent experience",
      "Experience building applications using .Net Full Framework (4.0 – 4.8) and .Net (2.2 – 7.0)",
      "Expert in using web technologies, such as HTML, CSS, Javascript, Internet technologies, communication protocols, and techniques",
      "Experience in building applications using React, Redux / Flux, KnockoutJS",
      "Experience with database methodologies and database systems including SQL Server and MongoDB.",
      "Has knowledge of current software design practices, including modularity, event-driven architecture, object-oriented design, interface design, localization, portability, extensibility, and testability",
      "Has experience working in a Scrum / Agile development environment with great understanding of CI / CD practices",
      "Has good communication skills",
      "Self-motivated and works with minimal supervision",
      "Compensation",
      "The salary range for this role is $110,000 -$125,000 CAD annually. We consider several factors when determining a proposed salary range, including but not limited to: experience, education, location, budget, and internal equity. Our compensation philosophy emphasizes fairness and consistency, and job offers will be evaluated case-by-case.",
      "Benefits \u0026 Perks",
      "Comprehensive Benefits Package including, Medical, Dental, Vision and Paramedical benefits, as of day one ",
      "Optional company match RRSP program ",
      "Virtual fitness classes offered company-wide ",
      "Time-off including major holidays, vacation, sick, personal, \u0026 volunteer time ",
      "Discounted gym membership rate ",
      "Philanthropic support with both local and national organizations ",
      "Fun culture with company-wide contests and prizes ",
      "Equal Opportunity/Affirmative Action Employer",
      "Corpay is an Equal Opportunity Employer. Corpay provides equal employment opportunities to all employees and applicants without regard to race, color, gender (including pregnancy), religion, national origin, ancestry, disability, age, sexual orientation, gender identity or expression, marital status, language, ancestry, genetic information, veteran and/or military status or any other group status protected by federal or local law. If you require reasonable accommodation for the application and/or interview process, please notify a representative of the Human Resources Department.",
      "For more information about our commitment to equal employment opportunity and pay transparency, please click the following links: EEO and Pay Transparency",
      "#CORPAY #INDTECH",
      "Other details",
      "Job Family IT",
      "Pay Type Salary",
      "Employment Indicator Employee",
      "Apply Now"
    ]
  }
]