[
  {
    "Id": "4248904997",
    "CompanyName": "Motorola Solutions",
    "JobOfferTitle": "Senior Software Developer experienced in .NET \u0026 Azure Cloud development in C#",
    "JobOfferSummarize": "Motorola Solutions is seeking a Senior Software Developer with expertise in .NET and Azure Cloud development in C#. The role involves creating cutting-edge web applications, peer code reviews, mentoring, and collaborating with UX and test teams. The candidate must have strong experience in C#, .NET Web Applications, and cloud development.",
    "EmailContact": "Not provided",
    "ContactHiringSection": "Not provided",
    "KeySkillsRequired": [
      {
        "Name": "C#",
        "RelevancePercentage": 30
      },
      {
        "Name": ".NET",
        "RelevancePercentage": 25
      },
      {
        "Name": "Azure Cloud",
        "RelevancePercentage": 20
      },
      {
        "Name": "Web Applications",
        "RelevancePercentage": 15
      },
      {
        "Name": "Microservices",
        "RelevancePercentage": 10
      }
    ],
    "EssentialQualifications": [
      {
        "Name": "Bachelor’s degree in Computer Science or a related technical discipline",
        "RelevancePercentage": 30
      },
      {
        "Name": "5\u002B years of experience writing in a C# or similar language",
        "RelevancePercentage": 40
      },
      {
        "Name": "5\u002B years of experience building and maintaining .NET Web Applications",
        "RelevancePercentage": 30
      }
    ],
    "EssentialTechnicalSkillQualifications": [
      {
        "Name": "Solid understanding of data structures, asynchronous architectures and building data-intensive applications",
        "RelevancePercentage": 25
      },
      {
        "Name": "Experience with developing cloud applications",
        "RelevancePercentage": 20
      },
      {
        "Name": "Experience with managing cloud resources and building CI/CD pipelines",
        "RelevancePercentage": 20
      },
      {
        "Name": "Experience designing and building microservices",
        "RelevancePercentage": 20
      },
      {
        "Name": "Experience developing RESTful API\u0027s used with web browsers, backend servers, or mobile applications",
        "RelevancePercentage": 15
      }
    ],
    "OtherTechnicalSkillQualifications": [
      {
        "Name": "Excellent written and oral communication skills, including the ability to produce clear, concise documentation",
        "RelevancePercentage": 70
      },
      {
        "Name": "Experience with React",
        "RelevancePercentage": 15
      },
      {
        "Name": "Experience with AI/machine learning technologies",
        "RelevancePercentage": 15
      }
    ],
    "SalaryOrBudgetOffered": "62,600 - 130,000 CAD depending on experience",
    "Description": "The Senior Software Developer will be responsible for creating cutting-edge web applications, peer code reviews, mentoring, and collaborating with UX and test teams. The role requires expertise in C#, .NET Web Applications, and cloud development. The candidate must have strong communication skills and experience with microservices and RESTful APIs. The position is based in Vancouver, BC, with a hybrid work schedule.",
    "Url": "https://www.linkedin.com/jobs/view/4248904997/",
    "RawJobDescription": [
      "About the job",
      "Company Overview",
      "",
      "At Motorola Solutions, we believe that everything starts with our people. We’re a global close-knit community, united by the relentless pursuit to help keep people safer everywhere. Our critical communications, video security and command center technologies support public safety agencies and enterprises alike, enabling the coordination that’s critical for safer communities, safer schools, safer hospitals and safer businesses. Connect with a career that matters, and help us build a safer future.",
      "Aperçu de l’entreprise",
      "Chez Motorola Solutions, nous pensons que tout commence par nos employés. Nous sommes une communauté mondiale soudée, unie par la volonté incessante de contribuer à la sécurité des personnes partout dans le monde. Nos technologies de communication, de sécurité vidéo et de centre de commandement essentielles soutiennent les agences de sécurité publique et les entreprises, permettant une coordination essentielle pour des communautés, des écoles, des hôpitaux et des entreprises plus sécuritaires. Connectez-vous à une carrière qui compte et aidez-nous à bâtir un avenir plus sûr.",
      "Department Overview",
      "Motorola Solution’s Video Division is defining the future of the security industry through innovative end-to-end-solutions. We’re changing the landscape of the surveillance industry through advanced award-winning AI based surveillance systems. Artificial Intelligence is transforming the world and our team is advancing the field as it applies to the surveillance industry. We are proud to be industry leaders in video analytics with products like Appearance Search and Unusual Motion Detection along with our recently launched Avigilon cloud service platform. You will have the opportunity to contribute to intelligent camera surveillance systems through cutting edge research and software engineering.",
      "Job Description",
      "We are seeking a Senior Software Developer experienced in .NET \u0026 Azure Cloud development in C#.",
      "Responsibilities include:",
      "Create cutting edge web applications. Candidates should feel comfortable transitioning from back end web projects along and desktop projects. ",
      "Regardless of tech stack, candidate should be focused on usability, responsiveness, scalability, testability and best coding and design practices",
      "Peer review code for adherence to coding standards and design guidelines",
      "Mentoring peers and scrum team building",
      "Collaborate with UX and visual designers on proposed designs",
      "Collaborate with the Automation and Test team on identifying test cases for new features and regression testing",
      "Build and deploy your microservices in Kubernetes",
      "Qualifications:",
      "Bachelor’s degree in Computer Science or a related technical discipline",
      "5\u002B years of experience writing in a C# or similar language",
      "5\u002B years of experience building and maintaining .NET Web Applications",
      "Solid understanding of data structures, asynchronous architectures and building data-intensive applications",
      "Experience with developing cloud applications",
      "You are equally excited to build a minimum viable product as you are cementing a feature in maintainable and tested code",
      "Excellent written and oral communication skills, including the ability to produce clear, concise documentation",
      "Experience with managing cloud resources and building CI/CD pipelines",
      "Experience designing and building microservices",
      "Experience developing RESTful API\u0027s used with web browsers, backend servers, or mobile applications",
      "Nice to have:",
      "Experience with React",
      "Experience with AI/machine learning technologies is strongly preferred",
      "This position is based in Vancouver, BC and the candidate must reside in the Greater Vancouver Area as you will be required to go into the office on a hybrid work schedule.",
      "The base salary for this position in British Columbia is 62,600 - 130,000 CAD depending on experience.",
      "Basic Requirements",
      "Bachelors Degree",
      "4\u002B years of software development experience",
      "Travel Requirements",
      "Under 10%",
      "Relocation Provided",
      "None",
      "Position Type",
      "Experienced",
      "Referral Payment Plan",
      "Yes",
      "EEO Statement",
      "Motorola Solutions is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion or belief, sex, sexual orientation, gender identity, national origin, disability, veteran status or any other legally-protected characteristic.",
      "We are proud of our people-first and community-focused culture, empowering every Motorolan to be their most authentic self and to do their best work to deliver on the promise of a safer world. If you’d like to join our team but feel that you don’t quite meet all of the preferred skills, we’d still love to hear why you think you’d be a great addition to our team.",
      "We’re committed to providing an inclusive and accessible recruiting experience for candidates with disabilities, or other physical or mental health conditions. To request an accommodation, please complete this Reasonable Accommodations Form so we can assist you.",
      "Motorola Solutions adopte, favorise et promeut les principes de diversité, d’équité et d’inclusion. Nous encourageons et accueillons les candidatures de toutes les personnes qualifiées, quelles que soient leur race, origines ethnique, religion ou croyance, orientation sexuelle, identité et expression sexuelle, statut d’anciens combattants ou tout autre statut protégé par la Loi.",
      "Nous sommes fiers de notre culture axée sur les personnes et les communautés, encourageant ainsi chaque Motorolan d’être la version la plus authentique de lui-même dans ses responsabilités afin de tenir la promesse d’un monde plus sécuritaire.",
      "Si vous souhaitez vous joindre à notre communauté mais croyez que vous ne possédez pas toutes les exigences requises pour le poste convoité, nous aimerions tout de même connaître les raisons pour lesquelles vous pensez être un excellent candidat pour notre équipe.",
      "Nous offrons également des mesures d’adaptation pendant toutes les étapes du processus d’embauche afin de favoriser l’inclusion des personnes vivant avec un handicap physique et/ou mental. Pour demander un aménagement, veuillez remplir ce formulaire d\u0027aménagement raisonnable afin que nous puissions vous aider."
    ]
  },
  {
    "Id": "4256084193",
    "CompanyName": "Global Relay",
    "JobOfferTitle": "Intermediate C# Developer",
    "JobOfferSummarize": "As an Intermediate C# Developer at Global Relay, you’ll use leading-edge technologies to build pioneering products for global users. You will tackle scalability and high availability challenges in big data environments, working alongside top C# developers in an agile, collaborative environment.",
    "EmailContact": "Not provided",
    "ContactHiringSection": "Not provided",
    "KeySkillsRequired": [
      {
        "Name": "C#",
        "RelevancePercentage": 40
      },
      {
        "Name": "Multi-threaded programming",
        "RelevancePercentage": 20
      },
      {
        "Name": "Agile methodologies",
        "RelevancePercentage": 15
      },
      {
        "Name": "Test-driven development",
        "RelevancePercentage": 10
      },
      {
        "Name": "Service-oriented architecture",
        "RelevancePercentage": 10
      },
      {
        "Name": "Object-relational mapping",
        "RelevancePercentage": 5
      }
    ],
    "EssentialQualifications": [
      {
        "Name": "Minimum 5 years of C# developer experience",
        "RelevancePercentage": 50
      },
      {
        "Name": "Experience with multi-threaded programming and design patterns",
        "RelevancePercentage": 30
      },
      {
        "Name": "Experience with agile development methodologies",
        "RelevancePercentage": 20
      }
    ],
    "EssentialTechnicalSkillQualifications": [
      {
        "Name": "Experience with test driven development, continuous integration systems, and dependency injection containers",
        "RelevancePercentage": 30
      },
      {
        "Name": "Experience with network protocols such as HTTP, TLS, TCP",
        "RelevancePercentage": 25
      },
      {
        "Name": "Experience with service-oriented architecture including Thrift, REST, and JSON",
        "RelevancePercentage": 25
      },
      {
        "Name": "Experience with object relational mapping architecture including T-SQL, NHibernate, Entity Framework",
        "RelevancePercentage": 20
      }
    ],
    "OtherTechnicalSkillQualifications": [
      {
        "Name": "Strong communication skills",
        "RelevancePercentage": 70
      },
      {
        "Name": "Self-motivated and independent",
        "RelevancePercentage": 30
      }
    ],
    "SalaryOrBudgetOffered": "$80,000—$100,000 CAD",
    "Description": "The Intermediate C# Developer will work on enterprise services using C#, collaborate with agile teams, and design software implementations. Responsibilities include writing unit tests, developing deployment systems, and supporting production operations. The role requires 5\u002B years of C# experience and expertise in multi-threaded programming, agile methodologies, and service-oriented architecture.",
    "Url": "https://www.linkedin.com/jobs/view/4256084193/",
    "RawJobDescription": [
      "About the job",
      "Who we are:",
      "",
      "For over 20 years, Global Relay has set the standard in enterprise information archiving with industry-leading cloud archiving, surveillance, eDiscovery, and analytics solutions. We securely capture and preserve the communications data of the world’s most highly regulated firms, giving them greater visibility and control over their information and ensuring compliance with stringent regulations.",
      "Though we offer competitive compensation and benefits and all the other perks one would expect from an established company, we are not your typical technology company. Global Relay is a career-building company. A place for big ideas. New challenges. Groundbreaking innovation. It’s a place where you can genuinely make an impact – and be recognized for it.",
      "We believe great businesses thrive on diversity, inclusion, and the contributions of all employees. To that end, we recruit candidates from different backgrounds and foster a work environment that encourages employees to collaborate and learn from each other, completely free of barriers.",
      "Your role:",
      "As an Intermediate C# Developer at Global Relay, you’ll be using leading edge technologies to build pioneering products that are used by tens of thousands of users globally to solve real world business problems. You will tackle interesting and engaging problems regarding scalability and high availability in big data environments. At Global Relay we are continuously pushing the boundaries of C# technology.",
      "This is an opportunity to work alongside some of the best C# developers in Vancouver and apply your craft in an environment that encourages creative thinking and autonomy. Our software is developed by small, focused, and agile teams of developers and QA. We encourage our developers to think beyond a single component to build complete system solutions. Challenge yourself by learning new technologies, and apply your skills across our different projects and application domains. If you are committed to code that is clean, well-tested, well-reviewed, performant, and secure then you’ll fit in around here.",
      "Your responsibilities:",
      "Work as part of an agile development team to write C# code for enterprise services",
      "Write unit and integration tests for your C# code",
      "Design, in collaboration with team, the software implementations that satisfy business requirements",
      "Collaborate with QA in development of test cases for C# code",
      "Develop deployment systems for C# based systems",
      "Document code and document detail designs",
      "Collaborate with product owners on user story generation and refinement",
      "Monitor and support operation of production systems",
      "Participate in knowledge sharing activities with colleagues",
      "About you:",
      "Minimum 5 years of C# developer experience",
      "Experience with multi-threaded programming and design patterns",
      "Experience with Java or another OOP language is an asset",
      "Experience with agile development methodologies",
      "Experience with test driven development, continuous integration systems, and dependency injection containers",
      "Experience with network protocols such as HTTP, TLS, TCP",
      "Experience with service-oriented architecture including Thrift, REST, and JSON",
      "Experience with object relational mapping architecture including T-SQL, NHibernate, Entity Framework",
      "Compensation:",
      "Global Relay advertises the pay range for this role in compliance with British Columbia’s pay transparency laws. Individual pay rates are determined by evaluating factors such as expertise, skills, education, and professional background.",
      "The range below reflects the expected annual base salary, which is only one element of our comprehensive total rewards package designed to reflect our company pay philosophy, culture and values. We aim to foster an inspiring work environment and support employees\u0027 work-life rhythms. We provide a comprehensive extended health benefits program, including virtual healthcare and a wellness allowance. Employees also receive annual allotted vacation days, which increase based on tenure. Other benefits include: Paid sick days, maternity/parental enhancement program, corporate bonuses, and an RRSP contribution matching program.",
      "For Vancouver-based employees, we provide a subsidized meal program, courtesy of our talented in-house culinary team!",
      "British Columbia - Base Salary Range:",
      "$80,000—$100,000 CAD",
      "What you can expect:",
      "At Global Relay, there’s no ceiling to what you can achieve. It’s the land of opportunity for the energetic, the intelligent, the driven. You’ll receive the mentoring, coaching, and support you need to reach your career goals. You’ll be part of a culture that breeds creativity and rewards perseverance and hard work. And you’ll be working alongside smart, talented individuals from diverse backgrounds, with complementary knowledge and skills.",
      "Global Relay is an equal-opportunity employer committed to diversity, equity, and inclusion.",
      "We seek to ensure reasonable adjustments, accommodations, and personal time are tailored to meet the unique needs of every individual.",
      "We understand flexible work arrangements are important, and we encourage that in our work culture. Whether it’s flexibility around work hours, workstyle, or lifestyle, we want to ensure our employees have a healthy work/life balance. We support and value a hybrid work model that blends collaboration with the team in the office and focus time from the comfort of your home.",
      "To learn more about our business, culture, and community involvement, visit www.globalrelay.com."
    ]
  },
  {
    "Id": "4188413939",
    "CompanyName": "Corpay",
    "JobOfferTitle": "Senior Fullstack .NET Developer",
    "JobOfferSummarize": "Corpay is seeking a Senior Fullstack .NET Developer to join their Buyatab division in Vancouver, Canada. The role involves providing technical direction, leading projects, and architecting code while working in a hybrid environment. The ideal candidate will have extensive experience with C#, .NET, JavaScript, and Agile methodologies.",
    "EmailContact": "Not provided",
    "ContactHiringSection": "Not provided",
    "KeySkillsRequired": [
      {
        "Name": "C#",
        "RelevancePercentage": 30
      },
      {
        "Name": ".NET",
        "RelevancePercentage": 25
      },
      {
        "Name": "JavaScript",
        "RelevancePercentage": 15
      },
      {
        "Name": "ASP.NET",
        "RelevancePercentage": 10
      },
      {
        "Name": "React",
        "RelevancePercentage": 10
      },
      {
        "Name": "SQL Server",
        "RelevancePercentage": 10
      }
    ],
    "EssentialQualifications": [
      {
        "Name": "8\u002B years of experience using C#, Javascript and debugging techniques",
        "RelevancePercentage": 50
      },
      {
        "Name": "B.S./M.S. in Computer Science or equivalent experience",
        "RelevancePercentage": 30
      },
      {
        "Name": "Experience with .NET Full Framework (4.0–4.8) and .NET (2.2–7.0)",
        "RelevancePercentage": 20
      }
    ],
    "EssentialTechnicalSkillQualifications": [
      {
        "Name": "Expert in HTML/CSS/JavaScript and web protocols",
        "RelevancePercentage": 30
      },
      {
        "Name": "Experience with React/Redux/KnockoutJS",
        "RelevancePercentage": 25
      },
      {
        "Name": "SQL Server/MongoDB proficiency",
        "RelevancePercentage": 20
      },
      {
        "Name": "Knowledge of OOP, modular design, and CI/CD",
        "RelevancePercentage": 15
      },
      {
        "Name": "Scrum/Agile experience",
        "RelevancePercentage": 10
      }
    ],
    "OtherTechnicalSkillQualifications": [
      {
        "Name": "Strong communication skills",
        "RelevancePercentage": 70
      },
      {
        "Name": "Self-motivated and works with minimal supervision",
        "RelevancePercentage": 30
      }
    ],
    "SalaryOrBudgetOffered": "$115,000 -$125,000 per annum",
    "Description": "The Senior Fullstack .NET Developer will provide technical direction, lead projects, and architect code while working in a hybrid environment. Responsibilities include designing complex transaction control systems, refactoring legacy applications, and integrating with third-party web services. The role requires expertise in C#, .NET, JavaScript, and Agile methodologies, along with strong communication skills and self-motivation.",
    "Url": "https://www.linkedin.com/jobs/view/4188413939/",
    "RawJobDescription": [
      "About the job",
      "What We Need",
      "",
      "Corpay is currently looking to hire a Senior Fullstack .NET Developer within our Buyatab division. This position falls under our SVS (Stored Value Solutions) line of business and is located in Vancouver, Canada. In the role, the Senior Fullstack .NET Developer will have a wealth of hands-on experience using C# and .NET technologies. You are passionate about agile methodology, and want to contribute to a fast paced, highly collaborative Scrum team. You love learning, being challenged, and challenging others to grow and improve. You bring creative ideas and novel approaches to solving problems.",
      "How We Work",
      "As a Senior Fullstack .NET Developer, you will be expected to work in a hybrid environment at our Vancouver, Canada office location. Corpay will set you up for success by providing:",
      " Company-issued equipment ",
      " Assigned workspace in a hybrid environment ",
      " Formal, hands-on training ",
      "Role Responsibilities",
      " Providing technical direction, planning, and vision to development team members. ",
      " As a lead programmer on new projects, creating, maintaining, and owning technical specifications, designs, and schedules with little direction from manager ",
      " Forging strong relationships across departments and to other companies. Communicates programming needs and interests to product team and others. ",
      " Anticipating and acts upon issues and problems that arise, providing alternative approaches and solutions. ",
      " Architecting and implementing significant portions of code, leveraging work across more than one product. ",
      " Seeking out new tools and techniques to facilitate work. ",
      " Insisting on highest quality in own work and that of others. ",
      " Designing and implementing complex transaction control systems involving secure web application development and integrating with third party web services ",
      " Refactoring and migrating legacy applications to distributed application architecture in AWS cloud ",
      " Leading by example ",
      "Qualifications \u0026 Skills",
      " 8\u002B years of experience using C#, Javascript and debugging techniques for developing ASP.Net, Asp.Net Core applications ",
      " B.S./M.S. in Computer Science, experience in developing two or more commercially used applications, or equivalent experience ",
      " Experience building applications using .Net Full Framework (4.0 – 4.8) and .Net (2.2 – 7.0) ",
      " Expert in using web technologies, such as HTML, CSS, Javascript, Internet technologies, communication protocols, and techniques ",
      " Experience in building applications using React, Redux / Flux, KnockoutJS ",
      " Experience with database methodologies and database systems including SQL Server and MongoDB. ",
      " Has knowledge of current software design practices, including modularity, event-driven architecture, object-oriented design, interface design, localization, portability, extensibility, and testability ",
      " Has experience working in a Scrum / Agile development environment with great understanding of CI / CD practices ",
      " Has good communication skills ",
      " Self-motivated and works with minimal supervision ",
      "This salary range is provided for locations which require such disclosure. Where a position or applicant may fall in a particular wage range varies depending on a number of factors, including but not limited to skill sets, experience, training, licensure and certifications (if applicable), and other business and organization needs. The disclosed range has not been adjusted for the applicable geographic markets. At Corpay, it is not typical for an individual to be hired at or near the top of the range for their role, and compensation decisions are dependent on the facts and circumstances of each case. An estimate of the minimum and maximum salary range is $115,000 -$125,000 per annum.",
      "Benefits \u0026 Perks",
      " Comprehensive Benefits Package including, Medical, Dental, Vision and Paramedical benefits, as of day one ",
      " Optional company match RRSP program ",
      " Virtual fitness classes offered company-wide ",
      " Time-off including major holidays, vacation, sick, personal, \u0026 volunteer time ",
      " Discounted gym membership rate ",
      " Philanthropic support with both local and national organizations ",
      " Fun culture with company-wide contests and prizes ",
      "Our Company \u0026 Purpose",
      "Corpay is a global leader in business payments, laser focused on developing smarter ways for businesses to pay their expenses. Since 2000, Corpay has developed innovative digital solutions that help businesses better track, manage, and pay their expenses. Today, Corpay is an S\u0026P 500 company with hundreds of thousands of customers using our products in over 100 countries. Companies of all sizes, industries and geographies rely on our product portfolio to manage spending more quickly, efficiently and securely than ever before.",
      "We embrace a culture grounded in five key values: integrity, collaboration, innovation, execution and people. These values offer you the opportunity to ‘thrive \u0026 grow’ through career development, volunteer, community, and wellness initiatives. This allows you to create a balance between professional goals and personal achievement.",
      "Corpay is also committed to building and nurturing a culture of diversity, inclusion, equality, and belonging by:",
      " Welcoming people of different backgrounds, cultures, ethnicities, genders, and sexual orientations; ",
      " Empowering our people to share their experiences and ideas through open forums and individual conversations; and ",
      " Valuing each person’s unique perspectives and individual contributions. ",
      "Embracing diversity enables our people to “make the difference” as Corpay and its more than 8,000 employees continue to shape the future of global payments. Learn more by visiting www.corpay.com or following Corpay on LinkedIn .",
      " Equal Opportunity/Affirmative Action Employer ",
      "Corpay is an Equal Opportunity Employer. Corpay provides equal employment opportunities to all employees and applicants without regard to race, color, gender (including pregnancy), religion, national origin, ancestry, disability, age, sexual orientation, gender identity or expression, marital status, language, ancestry, genetic information, veteran and/or military status or any other group status protected by federal or local law. If you require reasonable accommodation for the application and/or interview process, please notify a representative of the Human Resources Department.",
      " For more information about our commitment to equal employment opportunity and pay transparency, please click the following links: EEO and Pay Transparency ",
      "Apply Now"
    ]
  },
  {
    "Id": "4253874873",
    "CompanyName": "Corpay",
    "JobOfferTitle": "Senior Full .NET Stack Developer",
    "JobOfferSummarize": "Corpay is seeking a Senior Full .NET Stack Developer to join their Buyatab division in Vancouver. The role involves providing technical direction, leading projects, and architecting code. The ideal candidate will have extensive experience with C#, .NET, and JavaScript, and thrive in a Scrum/Agile environment.",
    "EmailContact": "Not provided",
    "ContactHiringSection": "Not provided",
    "KeySkillsRequired": [
      {
        "Name": "C#",
        "RelevancePercentage": 30
      },
      {
        "Name": ".NET",
        "RelevancePercentage": 25
      },
      {
        "Name": "JavaScript",
        "RelevancePercentage": 15
      },
      {
        "Name": "ASP.NET",
        "RelevancePercentage": 10
      },
      {
        "Name": "React",
        "RelevancePercentage": 10
      },
      {
        "Name": "SQL Server",
        "RelevancePercentage": 10
      }
    ],
    "EssentialQualifications": [
      {
        "Name": "8\u002B years of experience using C#, Javascript and debugging techniques",
        "RelevancePercentage": 50
      },
      {
        "Name": "B.S./M.S. in Computer Science or equivalent experience",
        "RelevancePercentage": 30
      },
      {
        "Name": "Experience with .NET Full Framework (4.0–4.8) and .NET (2.2–7.0)",
        "RelevancePercentage": 20
      }
    ],
    "EssentialTechnicalSkillQualifications": [
      {
        "Name": "Expert in HTML/CSS/JavaScript and web protocols",
        "RelevancePercentage": 30
      },
      {
        "Name": "Experience with React/Redux/KnockoutJS",
        "RelevancePercentage": 25
      },
      {
        "Name": "SQL Server/MongoDB proficiency",
        "RelevancePercentage": 20
      },
      {
        "Name": "Knowledge of OOP, modular design, and CI/CD",
        "RelevancePercentage": 15
      },
      {
        "Name": "Scrum/Agile experience",
        "RelevancePercentage": 10
      }
    ],
    "OtherTechnicalSkillQualifications": [
      {
        "Name": "Strong communication skills",
        "RelevancePercentage": 70
      },
      {
        "Name": "Self-motivated and independent",
        "RelevancePercentage": 30
      }
    ],
    "SalaryOrBudgetOffered": "$110,000 -$125,000 CAD annually",
    "Description": "The Senior Full .NET Stack Developer will provide technical direction, lead projects, and architect code. Responsibilities include designing complex transaction control systems, refactoring legacy applications, and integrating with third-party services. The role requires expertise in C#, .NET, JavaScript, and experience with Scrum/Agile methodologies.",
    "Url": "https://www.linkedin.com/jobs/view/4253874873/",
    "RawJobDescription": [
      "About the job",
      "Vancouver, BC, Canada Req #10490",
      "",
      "Tuesday, December 17, 2024",
      "What We Need",
      "Corpay is currently looking to hire a Senior Full .NET Stack Developer within our Buyatab division. This position falls under our SVS (Stored Value Solutions) line of business and is located in Vancouver, Canada. In the role, the Senior Full .NET Stack Developer will have a wealth of hands-on experience using C# and .NET technologies. You are passionate about agile methodology, and want to contribute to a fast paced, highly collaborative Scrum team. You love learning, being challenged, and challenging others to grow and improve. You bring creative ideas and novel approaches to solving problems.",
      "How We Work",
      "As a Senior Full .NET Stack Developer, you will be expected to work in a hybrid environment reporting our Vancouver, Canada office location. Corpay will set you up for success by providing:",
      "Company-issued equipment",
      "Assigned workspace in a hybrid environment",
      "Formal, hands-on training",
      "Monthly home internet stipend",
      "Role Responsibilities",
      "The responsibilities of the role will include:",
      "Providing technical direction, planning, and vision to development team members. ",
      "As a lead programmer on new projects, creating, maintaining, and owning technical specifications, designs, and schedules with little direction from manager ",
      "Forging strong relationships across departments and to other companies. Communicates programming needs and interests to product team and others.",
      "Anticipating and acts upon issues and problems that arise, providing alternative approaches and solutions.",
      "Architecting and implementing significant portions of code, leveraging work across more than one product. ",
      "Seeking out new tools and techniques to facilitate work. ",
      "Insisting on highest quality in own work and that of others. ",
      "Designing and implementing complex transaction control systems involving secure web application development and integrating with third party web services",
      "Refactoring and migrating legacy applications to distributed application architecture in AWS cloud",
      "Leading by example",
      "Qualifications \u0026 Skills",
      "8\u002B years of experience using C#, Javascript and debugging techniques for developing ASP.Net, Asp.Net Core applications",
      "B.S./M.S. in Computer Science, experience in developing two or more commercially used applications, or equivalent experience",
      "Experience building applications using .Net Full Framework (4.0 – 4.8) and .Net (2.2 – 7.0)",
      "Expert in using web technologies, such as HTML, CSS, Javascript, Internet technologies, communication protocols, and techniques",
      "Experience in building applications using React, Redux / Flux, KnockoutJS",
      "Experience with database methodologies and database systems including SQL Server and MongoDB.",
      "Has knowledge of current software design practices, including modularity, event-driven architecture, object-oriented design, interface design, localization, portability, extensibility, and testability",
      "Has experience working in a Scrum / Agile development environment with great understanding of CI / CD practices",
      "Has good communication skills",
      "Self-motivated and works with minimal supervision",
      "Compensation",
      "The salary range for this role is $110,000 -$125,000 CAD annually. We consider several factors when determining a proposed salary range, including but not limited to: experience, education, location, budget, and internal equity. Our compensation philosophy emphasizes fairness and consistency, and job offers will be evaluated case-by-case.",
      "Benefits \u0026 Perks",
      "Comprehensive Benefits Package including, Medical, Dental, Vision and Paramedical benefits, as of day one ",
      "Optional company match RRSP program ",
      "Virtual fitness classes offered company-wide ",
      "Time-off including major holidays, vacation, sick, personal, \u0026 volunteer time ",
      "Discounted gym membership rate ",
      "Philanthropic support with both local and national organizations ",
      "Fun culture with company-wide contests and prizes ",
      "Equal Opportunity/Affirmative Action Employer",
      "Corpay is an Equal Opportunity Employer. Corpay provides equal employment opportunities to all employees and applicants without regard to race, color, gender (including pregnancy), religion, national origin, ancestry, disability, age, sexual orientation, gender identity or expression, marital status, language, ancestry, genetic information, veteran and/or military status or any other group status protected by federal or local law. If you require reasonable accommodation for the application and/or interview process, please notify a representative of the Human Resources Department.",
      "For more information about our commitment to equal employment opportunity and pay transparency, please click the following links: EEO and Pay Transparency",
      "#CORPAY #INDTECH",
      "Other details",
      "Job Family IT",
      "Pay Type Salary",
      "Employment Indicator Employee",
      "Apply Now"
    ]
  },
  {
    "Id": "4234497427",
    "CompanyName": "Fortinet",
    "JobOfferTitle": "Senior Software Applications Developer",
    "JobOfferSummarize": "The FortiCare team at Fortinet is seeking a Senior Software Applications Developer to work on multi-tier web applications, microservices, and latest web client technologies. The role involves developing and supporting applications for product registration, order fulfillment, and CRM support. The ideal candidate will work with experienced developers to enhance software architecture and design skills.",
    "EmailContact": "Not provided",
    "ContactHiringSection": "Not provided",
    "KeySkillsRequired": [
      {
        "Name": "C#",
        "RelevancePercentage": 25
      },
      {
        "Name": ".NET",
        "RelevancePercentage": 20
      },
      {
        "Name": "SQL Server",
        "RelevancePercentage": 20
      },
      {
        "Name": "Web API 2",
        "RelevancePercentage": 15
      },
      {
        "Name": "JavaScript",
        "RelevancePercentage": 10
      },
      {
        "Name": "HTML5/CSS3",
        "RelevancePercentage": 10
      }
    ],
    "EssentialQualifications": [
      {
        "Name": "7\u002B years of .Net web applications programming experience",
        "RelevancePercentage": 50
      },
      {
        "Name": "7\u002B years SQL Server/T-SQL programming experience",
        "RelevancePercentage": 30
      },
      {
        "Name": "Understanding of web technologies like HTML5, CSS3, XML, JavaScript, AJAX, JSON, Web Service",
        "RelevancePercentage": 20
      }
    ],
    "EssentialTechnicalSkillQualifications": [
      {
        "Name": "Understanding of OO design and commonly used web application programming patterns like MVC",
        "RelevancePercentage": 30
      },
      {
        "Name": "Understanding of application development methodologies and lifecycle management",
        "RelevancePercentage": 25
      },
      {
        "Name": "Knowledge of Microsoft Azure services such as App Service, Blob Storage, Azure SQL, Azure Functions",
        "RelevancePercentage": 20
      },
      {
        "Name": "Cooperate with front-end developers in the process of creating RESTful APIs",
        "RelevancePercentage": 15
      },
      {
        "Name": "Participate in daily scrum meetings and take ownership of assigned stories",
        "RelevancePercentage": 10
      }
    ],
    "OtherTechnicalSkillQualifications": [
      {
        "Name": "Strong communication skills",
        "RelevancePercentage": 70
      },
      {
        "Name": "Self-motivated and independent",
        "RelevancePercentage": 30
      }
    ],
    "SalaryOrBudgetOffered": "$80,000 - $125,000 annually",
    "Description": "The Senior Software Applications Developer will work on multi-tier web applications and microservices, focusing on product registration, order fulfillment, and CRM support. Responsibilities include understanding business processes, system specifications, and application designs. The role requires expertise in Microsoft stack technologies and collaboration with front-end developers. The position offers competitive salary and comprehensive benefits.",
    "Url": "https://www.linkedin.com/jobs/view/4234497427/",
    "RawJobDescription": [
      "About the job",
      "The FortiCare team of the IT Department at Fortinet is looking for a Senior Software Applications Developer who is eager to work on multi-tier web applications, microservices, and the latest web client technologies. This team develops and supports multiple applications including product registration, order fulfillment, service contract/license management, service renewal, and a CRM support ticket application. The FortiCare systems are pure 3-tier web applications using MS .Net technologies and MS SQL Server as the backend database. The ideal candidate will have an opportunity to work alongside very experienced developers and enhance their software architecture and design skillset.",
      "",
      "Job Responsibilities",
      "Understand the company\u0027s business processes for product entitlement/license management, product renewals, and customer support",
      "Understand system specifications and application high-level designs",
      "Complete application detail designs",
      "Apply a strong knowledge of Microsoft stack including C#, Web API 2 and SQL Server",
      "Cooperate with front-end developers in the process of creating RESTful APIs",
      "Participate in daily scrum meetings and take ownership of assigned stories",
      "Job Skills Required for Back-end C# Developer",
      "7\u002B years of .Net web applications programming experience",
      "7\u002B years SQL Server/T-SQL programming experience",
      "Understanding of web technologies like HTML5, CSS3, XML, JavaScript, AJAX, JSON, Web Service, etc.",
      "Understanding of OO design and commonly used web application programming patterns like MVC, etc.",
      "Understanding of application development methodologies and lifecycle management",
      "Knowledge of Microsoft Azure services such as App Service, Blob Storage, Azure SQL, Azure Functions, etc. is a plus",
      "The Canada base salary range for this full-time position is expected to be between $80,000 - $125,000 annually. Wage ranges are based on various factors including the labour market, job type, and job level. Exact salary offers will be determined by factors such as the candidate\u0027s subject knowledge, skill level, qualifications, and experience.",
      "Fortinet strives to provide you and your family with a comprehensive benefits package. Benefits eligibility starts on your first day of hire and comprises of 100% company paid medical, dental, and vision coverage, including a Health Spending Account and a Personal Spending Account that gives you flexibility to spend where you need it the most. Our Employee \u0026 Family Assistance Plan (EFAP) offers you and your family access to various services like counseling, legal advice, mental health resources etc. We also provide critical illness, disability, and life insurance, as well as a Group Registered Retirement Savings Plan (RRSP) with a company match to help you save faster for retirement. We offer competitive Paid Time Off and flexible leave policies, including paid health days, to help you take care of yourself and your family members.",
      "All roles are eligible to participate in the Fortinet equity program. Bonus eligibility is reviewed at time of hire and annually at the Company\u0027s discretion.",
      "Why Join Us",
      "We encourage candidates from all backgrounds and identities to apply. We offer a supportive work environment and a competitive Total Rewards package to support you with your overall health and financial well-being. Embark on a challenging, enjoyable, and rewarding career journey with Fortinet. Join us in bringing solutions that make a meaningful and lasting impact to our 660,000\u002B customers around the globe.",
      "#GD",
      "SaveRemove",
      "share-facebook\u0022\u003E \u0022 class=\u0022cls-1\u0022 d=\u0022M15,0A15,15,0,1,0,30,15,15,15,0,0,0,15,0Zm3.25,15H16v8H13V15H11V12h2V10.71c0-1.27.29-3.26,2.94-3.26H18V10H16.76a0.83,0.83,0,0,0-.76.87V12h2.54Z\u0022\u003E share-twitter\u0022\u003E \u0022 class=\u0022cls-1\u0022 d=\u0022M15,0A15,15,0,1,0,30,15,15,15,0,0,0,15,0Zm5.79,12.39c0,0.12,0,.25,0,0.37A8.31,8.31,0,0,1,8,19.77c0.23,0,.46,0,0.7,0a5.94,5.94,0,0,0,3.65-1.25,2.91,2.91,0,0,1-2.71-2,4.07,4.07,0,0,0,.61,0,4.22,4.22,0,0,0,.87-0.1A2.76,2.76,0,0,1,9,13.61v0a1.33,1.33,0,0,0,1.12.37A3.11,3.11,0,0,1,8.6,11.51,2.91,2.91,0,0,1,9,10a8.29,8.29,0,0,0,6,3,2.93,2.93,0,0,1,5-2.67,5.69,5.69,0,0,0,1.85-.71,2.88,2.88,0,0,1-1.28,1.62,6,6,0,0,0,1.68-.46A6,6,0,0,1,20.79,12.39Z\u0022\u003E share-linkedin\u0022\u003E \u0022 class=\u0022cls-1\u0022 d=\u0022M16.19,13.74a0,0,0,0,0,0,0v0h0Z\u0022\u003E \u0022\u003E \u0022 class=\u0022cls-1\u0022 d=\u0022M15,0A15,15,0,1,0,30,15,15,15,0,0,0,15,0ZM11.83,21H9V12.52h2.82V21Zm-1.41-9.64h0a1.47,1.47,0,1,1,0-2.94A1.47,1.47,0,1,1,10.42,11.36ZM22,21H19.18V16.46c0-1.14-.41-1.92-1.43-1.92a1.56,1.56,0,0,0-1.45,1,2.1,2.1,0,0,0-.09.69V21H13.39s0-7.69,0-8.48h2.82v1.2a2.81,2.81,0,0,1,2.54-1.4c1.86,0,3.25,1.21,3.25,3.82V21Z\u0022\u003E share-email\u0022\u003E \u0022 class=\u0022cls-1\u0022 d=\u0022M15,0A15,15,0,1,0,30,15,15,15,0,0,0,15,0Zm9,21H6V10H24V21Zm-1-1.71v-7l-4,3ZM15,17l8-6H7Zm0.6,1H14.4l-2.57-2L7.71,20H22.29l-4.12-4ZM7,12.25v7l4-4Z\u0022\u003E share-print\u0022\u003E \u0022 class=\u0022cls-1\u0022 d=\u0022M10,8v3H20V8H10ZM8,12v6H9V17h1v5H20V17h1v1h1V12H8Zm2,2H9V13h1v1Zm9,7H11V20h8v1Zm0-2H11V18h8v1ZM8,12v6H9V17h1v5H20V17h1v1h1V12H8Zm2,2H9V13h1v1Zm9,7H11V20h8v1Zm0-2H11V18h8v1ZM10,8v3H20V8H10Zm0,0v3H20V8H10ZM8,12v6H9V17h1v5H20V17h1v1h1V12H8Zm2,2H9V13h1v1Zm9,7H11V20h8v1Zm0-2H11V18h8v1ZM8,12v6H9V17h1v5H20V17h1v1h1V12H8Zm2,2H9V13h1v1Zm9,7H11V20h8v1Zm0-2H11V18h8v1ZM20,8H10v3H20V8ZM15,0A15,15,0,1,0,30,15,15,15,0,0,0,15,0Zm8,19H21v4H9V19H7V11H9V7H21v4h2v8ZM8,18H9V17h1v5H20V17h1v1h1V12H8v6Zm3,0h8v1H11V18Zm0,2h8v1H11V20ZM9,13h1v1H9V13ZM20,8H10v3H20V8ZM10,8v3H20V8H10ZM8,12v6H9V17h1v5H20V17h1v1h1V12H8Zm2,2H9V13h1v1Zm9,7H11V20h8v1Zm0-2H11V18h8v1ZM8,12v6H9V17h1v5H20V17h1v1h1V12H8Zm2,2H9V13h1v1Zm9,7H11V20h8v1Zm0-2H11V18h8v1ZM10,8v3H20V8H10Z\u0022\u003E SaveRemove"
    ]
  },
  {
    "Id": "4253522670",
    "CompanyName": "SIGnature Recruiting",
    "JobOfferTitle": "Software Developer",
    "JobOfferSummarize": "The Software Developer will work on full-stack development projects, collaborating with a team to create web applications and integrations. Responsibilities include writing code, system testing, troubleshooting, and documentation. The role requires strong technical skills in .NET, C#, and various web technologies.",
    "EmailContact": "Not provided",
    "ContactHiringSection": "Not provided",
    "KeySkillsRequired": [
      {
        "Name": ".NET",
        "RelevancePercentage": 25
      },
      {
        "Name": "C#",
        "RelevancePercentage": 25
      },
      {
        "Name": "EntityFramework/LINQ",
        "RelevancePercentage": 15
      },
      {
        "Name": "React/Angular/Blazor",
        "RelevancePercentage": 10
      },
      {
        "Name": "SQL",
        "RelevancePercentage": 10
      },
      {
        "Name": "Azure",
        "RelevancePercentage": 10
      },
      {
        "Name": "API/SOAP/File Integrations",
        "RelevancePercentage": 5
      }
    ],
    "EssentialQualifications": [
      {
        "Name": "2\u002B years of relevant software development experience",
        "RelevancePercentage": 50
      },
      {
        "Name": "Extensive knowledge of .NET and C#, EntityFramework/LINQ",
        "RelevancePercentage": 30
      },
      {
        "Name": "Strong knowledge of database fundamentals (SQL, stored procedures, SQL agent jobs)",
        "RelevancePercentage": 20
      }
    ],
    "EssentialTechnicalSkillQualifications": [
      {
        "Name": "Experience with a UI platform like React, Angular, or Blazor",
        "RelevancePercentage": 25
      },
      {
        "Name": "Good understanding of Azure and Azure development tools",
        "RelevancePercentage": 20
      },
      {
        "Name": "Experience with integrations using various formats (e.g. API, SOAP, file formats like CSV, JSON, or txt)",
        "RelevancePercentage": 20
      },
      {
        "Name": "Familiarity with Azure Dev Ops (azure-pipelines, source control and release-management) or Git",
        "RelevancePercentage": 15
      },
      {
        "Name": "Proficiency in one or more scripting languages",
        "RelevancePercentage": 10
      },
      {
        "Name": "Familiarity with NetSuite APIs, customization, and scripting",
        "RelevancePercentage": 10
      }
    ],
    "OtherTechnicalSkillQualifications": [
      {
        "Name": "Excellent communication skills with team members of diverse backgrounds, skillsets, and goals",
        "RelevancePercentage": 40
      },
      {
        "Name": "Flexible and resilient, comfortable and adaptable to a high-change environment",
        "RelevancePercentage": 20
      },
      {
        "Name": "Genuine passion and curiosity towards tech through experimentation, evaluation, and continuous learning",
        "RelevancePercentage": 20
      },
      {
        "Name": "Strong business acumen and ability to talk to non-technical business users at all levels",
        "RelevancePercentage": 10
      },
      {
        "Name": "Eager to share newfound knowledge and mentor others",
        "RelevancePercentage": 10
      }
    ],
    "SalaryOrBudgetOffered": "$90-100k",
    "Description": "The Software Developer will work on full-stack development projects, collaborating with a team to create web applications and integrations. Responsibilities include writing code, system testing, troubleshooting, and documentation. The role requires strong technical skills in .NET, C#, and various web technologies.",
    "Url": "https://www.linkedin.com/jobs/view/4253522670/",
    "RawJobDescription": [
      "About the job",
      "Are you a .NET Software Developer who is passionate about technology and enjoys working in a team environment? Are you easy to work with and accountable? Our client is a diversified company in the transportation space that is a leader in their field and loves innovative ideas. We love this company because its employees can influence the success of the company and are able to work with like-minded, smart people.",
      "",
      "Reporting to the Manager of Application Development, the Software Developer will work with our software development team on various projects like web apps and integrations. This person will be involved in full-stack development from the user interface to the database.",
      "As a Software Developer, you will work across many different technologies and handle multiple tasks simultaneously. You can address problems with a collaborative approach, and you have a strong attention to detail, focused on writing quality code.",
      "Here is what you will be doing on a day-to-day basis:",
      "Develop web applications by writing code in various programming languages. Collaborate with other software developers, QA, and subject matter experts throughout the software development cycle.",
      "Develop and update integrations between various systems through coding as well as using off-the-shelf integration software.",
      "System test code to make sure it is high quality and meets requirements.",
      "Modify existing applications to fix issues and develop enhancements as required by users.",
      "Work with users to troubleshoot issues and clarify requirements with non-technical subject matter expects.",
      "Create user and system documentation.",
      "  Here is the type of person we are looking for:",
      "2\u002B years of relevant software development experience",
      "Extensive knowledge of .NET and C#, EntityFramework/LINQ",
      "Experience with a UI platform like React, Angular, or Blazor",
      "Strong knowledge of database fundamentals (SQL, stored procedures, SQL agent jobs)",
      "Good understanding of Azure and Azure development tools (Logic Apps, Function Apps, DataFactory, blob storage, service bus message queues)",
      "Experience with integrations using various formats (e.g. API, SOAP, file formats like CSV, JSON, or txt)",
      "Experience with an integration platform (Boomi, MuleSoft) is preferred",
      "Familiarity with Azure Dev Ops (azure-pipelines, source control and release-management) or Git",
      "Familiarity with NetSuite APIs, customization, and scripting is a plus",
      "Proficiency in one or more scripting languages",
      "Excellent communication skills with team members of diverse backgrounds, skillsets, and goals",
      "Willing to write and maintain technical documentation",
      "Flexible and resilient, comfortable, and adaptable to a high-change environment and open to new concepts and processes",
      "Genuine passion and curiosity towards tech through experimentation, evaluation, and continuous learning",
      "Strong business acumen and ability to talk to non-technical business users at all levels",
      "Eager to share newfound knowledge and mentor others",
      "Ability to work independently or as part of a team",
      " A full security background check will be required for this position.",
      "Salary range: $90-100k",
      " If you are interested in exploring this position, please apply now!",
      " Our client is an equal opportunity employer and values diversity at their company.",
      " People are our passion. People are our profession.",
      "Since 2010, SIGnature Recruiting has been pairing exceptional people with short-term contracts and long-term careers in Vancouver’s flourishing IT industry. We are specialists in IT Recruiting and pride ourselves in making valuable contributions to our clients and candidates."
    ]
  },
  {
    "Id": "4104783577",
    "CompanyName": "Fortinet",
    "JobOfferTitle": "Senior Software Applications Developer",
    "JobOfferSummarize": "The FortiCare team at Fortinet is seeking a Senior Software Applications Developer to work on multi-tier web applications, microservices, and latest web client technologies. The role involves developing and supporting applications for product registration, order fulfillment, and CRM support. The ideal candidate will work with experienced developers to enhance their software architecture and design skills.",
    "EmailContact": "Not provided",
    "ContactHiringSection": "Not provided",
    "KeySkillsRequired": [
      {
        "Name": "C#",
        "RelevancePercentage": 30
      },
      {
        "Name": ".NET",
        "RelevancePercentage": 25
      },
      {
        "Name": "SQL Server",
        "RelevancePercentage": 20
      },
      {
        "Name": "Web API 2",
        "RelevancePercentage": 15
      },
      {
        "Name": "RESTful APIs",
        "RelevancePercentage": 10
      }
    ],
    "EssentialQualifications": [
      {
        "Name": "7\u002B years of .Net web applications programming experience",
        "RelevancePercentage": 50
      },
      {
        "Name": "7\u002B years SQL Server/T-SQL programming experience",
        "RelevancePercentage": 30
      },
      {
        "Name": "Understanding of web technologies like HTML5, CSS3, XML, JavaScript, AJAX, JSON, Web Service, etc.",
        "RelevancePercentage": 20
      }
    ],
    "EssentialTechnicalSkillQualifications": [
      {
        "Name": "Understanding of OO design and commonly used web application programming patterns like MVC",
        "RelevancePercentage": 30
      },
      {
        "Name": "Understanding of application development methodologies and lifecycle management",
        "RelevancePercentage": 25
      },
      {
        "Name": "Knowledge of Microsoft Azure services such as App Service, Blob Storage, Azure SQL, Azure Functions, etc.",
        "RelevancePercentage": 20
      },
      {
        "Name": "Cooperation with front-end developers in the process of creating RESTful APIs",
        "RelevancePercentage": 15
      },
      {
        "Name": "Participation in daily scrum meetings and ownership of assigned stories",
        "RelevancePercentage": 10
      }
    ],
    "OtherTechnicalSkillQualifications": [
      {
        "Name": "Strong communication skills",
        "RelevancePercentage": 70
      },
      {
        "Name": "Self-motivated and independent",
        "RelevancePercentage": 30
      }
    ],
    "SalaryOrBudgetOffered": "$80,000 - $125,000 CAD annually",
    "Description": "The Senior Software Applications Developer will work on multi-tier web applications and microservices, focusing on product registration, order fulfillment, and CRM support. Responsibilities include understanding business processes, completing application designs, and applying strong knowledge of Microsoft stack technologies. The role requires 7\u002B years of .Net and SQL Server experience, along with understanding of web technologies and OO design.",
    "Url": "https://www.linkedin.com/jobs/view/4104783577/",
    "RawJobDescription": [
      "About the job",
      "Job Description",
      "",
      "The FortiCare team of the IT Department at Fortinet is looking for a Senior Software Applications Developer who is eager to work on multi-tier web applications, microservices, and the latest web client technologies. This team develops and supports multiple applications including product registration, order fulfillment, service contract/license management, service renewal, and a CRM support ticket application. The FortiCare systems are pure 3-tier web applications using MS .Net technologies and MS SQL Server as the backend database. The ideal candidate will have an opportunity to work alongside very experienced developers and enhance their software architecture and design skillset.",
      "Job Responsibilities",
      " Understand the company’s business processes for product entitlement/license management, product renewals, and customer support ",
      " Understand system specifications and application high-level designs ",
      " Complete application detail designs ",
      " Apply a strong knowledge of Microsoft stack including C#, Web API 2 and SQL Server ",
      " Cooperate with front-end developers in the process of creating RESTful APIs ",
      " Participate in daily scrum meetings and take ownership of assigned stories ",
      "Job Skills Required for Back-end C# Developer",
      " 7\u002B years of .Net web applications programming experience ",
      " 7\u002B years SQL Server/T-SQL programming experience ",
      " Understanding of web technologies like HTML5, CSS3, XML, JavaScript, AJAX, JSON, Web Service, etc. ",
      " Understanding of OO design and commonly used web application programming patterns like MVC, etc. ",
      " Understanding of application development methodologies and lifecycle management ",
      " Knowledge of Microsoft Azure services such as App Service, Blob Storage, Azure SQL, Azure Functions, etc. is a plus ",
      "The Canada base salary range for this full-time position is expected to be between $80,000 - $125,000 annually. Wage ranges are based on various factors including the labour market, job type, and job level. Exact salary offers will be determined by factors such as the candidate’s subject knowledge, skill level, qualifications, and experience.",
      "Fortinet strives to provide you and your family with a comprehensive benefits package. Benefits eligibility starts on your first day of hire and comprises of 100% company paid medical, dental, and vision coverage, including a Health Spending Account and a Personal Spending Account that gives you flexibility to spend where you need it the most. Our Employee \u0026 Family Assistance Plan (EFAP) offers you and your family access to various services like counseling, legal advice, mental health resources etc. We also provide critical illness, disability, and life insurance, as well as a Group Registered Retirement Savings Plan (RRSP) with a company match to help you save faster for retirement. We offer competitive Paid Time Off and flexible leave policies, including paid health days, to help you take care of yourself and your family members.",
      "All roles are eligible to participate in the Fortinet equity program. Bonus eligibility is reviewed at time of hire and annually at the Company’s discretion.",
      "Why Join Us:",
      "We encourage candidates from all backgrounds and identities to apply. We offer a supportive work environment and a competitive Total Rewards package to support you with your overall health and financial well-being. Embark on a challenging, enjoyable, and rewarding career journey with Fortinet. Join us in bringing solutions that make a meaningful and lasting impact to our 660,000\u002B customers around the globe.",
      "#GD"
    ]
  },
  {
    "Id": "4242930313",
    "CompanyName": "Motorola Solutions",
    "JobOfferTitle": "Senior Staff Full Stack Engineer",
    "JobOfferSummarize": "Motorola Solutions is seeking a Senior Staff Full Stack Engineer with extensive experience in C# development within Azure Cloud or Google Cloud Platform environments. The role involves providing technical leadership in new product development and maintenance, delivering large-scale public-facing applications and APIs, and contributing to architectural roadmaps. The position is based in Vancouver, BC, with a hybrid work schedule.",
    "EmailContact": "Not provided",
    "ContactHiringSection": "Not provided",
    "KeySkillsRequired": [
      {
        "Name": "C#",
        "RelevancePercentage": 30
      },
      {
        "Name": "Azure Cloud",
        "RelevancePercentage": 20
      },
      {
        "Name": "Google Cloud Platform",
        "RelevancePercentage": 20
      },
      {
        "Name": "JavaScript",
        "RelevancePercentage": 15
      },
      {
        "Name": "React",
        "RelevancePercentage": 10
      },
      {
        "Name": "Angular",
        "RelevancePercentage": 5
      }
    ],
    "EssentialQualifications": [
      {
        "Name": "7\u002B years of experience as a Software Engineer",
        "RelevancePercentage": 40
      },
      {
        "Name": "Bachelor’s degree in Computer Science or related",
        "RelevancePercentage": 30
      },
      {
        "Name": "Extensive experience in on-prem and cloud development in C#",
        "RelevancePercentage": 30
      }
    ],
    "EssentialTechnicalSkillQualifications": [
      {
        "Name": "Experience delivering cloud solutions using different JavaScript frameworks (React, Angular, NodeJs)",
        "RelevancePercentage": 30
      },
      {
        "Name": "Strong knowledge of CI/CD, test automation and DevOps",
        "RelevancePercentage": 25
      },
      {
        "Name": "Experience with AI/machine learning technologies",
        "RelevancePercentage": 20
      },
      {
        "Name": "Experience leading teams as a technical lead",
        "RelevancePercentage": 15
      },
      {
        "Name": "Successful delivery of large scale public facing application",
        "RelevancePercentage": 10
      }
    ],
    "OtherTechnicalSkillQualifications": [
      {
        "Name": "Excellent written and oral communication skills",
        "RelevancePercentage": 70
      },
      {
        "Name": "Growth-oriented perspective",
        "RelevancePercentage": 30
      }
    ],
    "SalaryOrBudgetOffered": "$75,700 - 155,200 CAD",
    "Description": "The Senior Staff Full Stack Engineer will provide hands-on technical leadership in new product development and maintenance, focusing on delivering complex, large-scale public-facing applications and APIs. The role involves contributing to architectural roadmaps, leveraging emerging technologies, and fostering a culture of continuous learning. The candidate must have extensive experience in C# development within Azure or Google Cloud environments and strong knowledge of DevOps, CI/CD, and test automation.",
    "Url": "https://www.linkedin.com/jobs/view/4242930313/",
    "RawJobDescription": [
      "About the job",
      "Company Overview",
      "",
      "At Motorola Solutions, we believe that everything starts with our people. We’re a global close-knit community, united by the relentless pursuit to help keep people safer everywhere. Our critical communications, video security and command center technologies support public safety agencies and enterprises alike, enabling the coordination that’s critical for safer communities, safer schools, safer hospitals and safer businesses. Connect with a career that matters, and help us build a safer future.",
      "Aperçu de l’entreprise",
      "Chez Motorola Solutions, nous pensons que tout commence par nos employés. Nous sommes une communauté mondiale soudée, unie par la volonté incessante de contribuer à la sécurité des personnes partout dans le monde. Nos technologies de communication, de sécurité vidéo et de centre de commandement essentielles soutiennent les agences de sécurité publique et les entreprises, permettant une coordination essentielle pour des communautés, des écoles, des hôpitaux et des entreprises plus sécuritaires. Connectez-vous à une carrière qui compte et aidez-nous à bâtir un avenir plus sûr.",
      "Department Overview",
      "Motorola Solution’s Video Division is defining the future of the security industry through innovative end-to-end-solutions. We’re changing the landscape of the surveillance industry through advanced award-winning AI based surveillance systems. Artificial Intelligence is transforming the world and our team is advancing the field as it applies to the surveillance industry. We are proud to be industry leaders in video analytics with products like Appearance Search and Unusual Motion Detection along with our recently launched Avigilon cloud service platform. You will have the opportunity to contribute to intelligent camera surveillance systems through cutting edge research and software engineering.",
      "Job Description",
      "We are seeking a Senior Staff Full Stack Engineer experienced in C# development within an Azure Cloud or Google Cloud Platform development environments that can provide hands on technical leadership in new product development and maintenance activities. The ideal candidate will have extensive experience delivering complex, large scale, public facing applications and APIs and have solid knowledge of DevOps, CI/CD and test automation tools and concepts.",
      "This position is based in Vancouver, BC and the candidate must reside in the Greater Vancouver Area as you will be required to go into the office on a hybrid work schedule.",
      "Why you\u0027ll love working here:",
      "Contributing to a product deployed in high-stakes safety scenarios:",
      "Solving for safer: Protecting the well-being of people in a variety of situations and environments",
      "Streamlining communication and improving reactions to critical safety incidents",
      "Supporting the creation of more secure events and public assemblies (e.g., SportsNFL games, music concerts)",
      "Commitment to professional development \u0026 advancement:",
      "Supportive managers dedicated to understanding and fostering your growth",
      "Well-defined role, responsibilities, and expectations",
      "10% dedicated time for continuous learning and professional development (1 day every two weeks)",
      "Gain experience solving different problems with different tech stacks:",
      "Solve critical problems based on camera analytics and AI",
      "Developing robust, large-scale APIs for both on-premise and cloud environments",
      "Work on rich UX to provide users with geospatial awareness and allow them to focus on critical items",
      "Diverse and inclusive team environment:",
      "Our teams prioritize creating a vibrant and welcoming culture",
      "Groups are designed to leverage a mix of opinions and personality types",
      "Responsibilities include:",
      "Key contributor within the Scrum team:",
      "Playing a role in the team’s journey to high performance",
      "Developing on Avigilon Unity Video Products to be used by security professionals around the world",
      "Building trust among team members to champion a culture of continuous learning and growth",
      "Participating in defining and executing t3he direction for build pipelines, containerization, DevOps tooling and test automation",
      "Providing end-to-end software solutions, encompassing design, architecture, implementation, testing, maintenance, and user support",
      "Contributing to the realization of our architectural roadmap:",
      "Active participant in our Architecture community of practice",
      "Ensuring architectural vision is shared and implemented across teams",
      "Leveraging emerging technologies and tools to enhance our product and architectural capabilities",
      "Consistently Showing up with:",
      "Energy and passion",
      "Optimistic outlook",
      "Transparent communication",
      "Growth-oriented perspective",
      "Growing and training our software organization:",
      "Fostering strong collaborative relationships with fellow developers and technical leadership",
      "Proactively providing technical guidance and mentorship",
      "Upholding rigorous standards for software development and quality, both personally and across the team",
      "Qualifications:",
      "Bachelor’s degree in Computer Science or related",
      "7\u002B years of experience as a Software Engineer",
      "Excellent written and oral communication skills",
      "Extensive experience in on-prem and cloud development in C#",
      "Experience delivering cloud solutions using different javascript frameworks (React, Angular, NodeJs)",
      "Preferred Qualifications:",
      "Experience leading teams as a technical lead",
      "Successful delivery of large scale public facing application",
      "Strong knowledge of CI/CD, test automation and DevOps",
      "Experience with AI/machine learning technologies is strongly preferred",
      "Target Base Salary Range: $75,700 - 155,200 CAD",
      "Consistent with Motorola Solutions values and applicable law, we provide the following information to promote pay transparency and equity. Pay within this range varies and depends on job-related knowledge, skills, and experience. The actual offer will be based on the individual candidate.",
      "Basic Requirements",
      "Bachelors Degree",
      "6\u002B years of experience in software development",
      "Travel Requirements",
      "Under 10%",
      "Relocation Provided",
      "None",
      "Position Type",
      "Experienced",
      "Referral Payment Plan",
      "No",
      "EEO Statement",
      "Motorola Solutions is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion or belief, sex, sexual orientation, gender identity, national origin, disability, veteran status or any other legally-protected characteristic.",
      "We are proud of our people-first and community-focused culture, empowering every Motorolan to be their most authentic self and to do their best work to deliver on the promise of a safer world. If you’d like to join our team but feel that you don’t quite meet all of the preferred skills, we’d still love to hear why you think you’d be a great addition to our team.",
      "We’re committed to providing an inclusive and accessible recruiting experience for candidates with disabilities, or other physical or mental health conditions. To request an accommodation, please complete this Reasonable Accommodations Form so we can assist you.",
      "Motorola Solutions adopte, favorise et promeut les principes de diversité, d’équité et d’inclusion. Nous encourageons et accueillons les candidatures de toutes les personnes qualifiées, quelles que soient leur race, origines ethnique, religion ou croyance, orientation sexuelle, identité et expression sexuelle, statut d’anciens combattants ou tout autre statut protégé par la Loi.",
      "Nous sommes fiers de notre culture axée sur les personnes et les communautés, encourageant ainsi chaque Motorolan d’être la version la plus authentique de lui-même dans ses responsabilités afin de tenir la promesse d’un monde plus sécuritaire.",
      "Si vous souhaitez vous joindre à notre communauté mais croyez que vous ne possédez pas toutes les exigences requises pour le poste convoité, nous aimerions tout de même connaître les raisons pour lesquelles vous pensez être un excellent candidat pour notre équipe.",
      "Nous offrons également des mesures d’adaptation pendant toutes les étapes du processus d’embauche afin de favoriser l’inclusion des personnes vivant avec un handicap physique et/ou mental. Pour demander un aménagement, veuillez remplir ce formulaire d\u0027aménagement raisonnable afin que nous puissions vous aider."
    ]
  },
  {
    "Id": "4234493090",
    "CompanyName": "Infosys",
    "JobOfferTitle": "Senior .net full stack dev lead",
    "JobOfferSummarize": "Infosys is seeking a Senior .net full stack dev lead to drive the end-to-end software development lifecycle, including design, development, testing, and deployment. The role requires expertise in ASP .NET, .NET Core, C#, and Azure services. Candidates must have at least 4 years of IT experience and be located in or willing to relocate to Burnaby.",
    "EmailContact": "Not provided",
    "ContactHiringSection": "Not provided",
    "KeySkillsRequired": [
      {
        "Name": "ASP .NET",
        "RelevancePercentage": 20
      },
      {
        "Name": ".NET Core",
        "RelevancePercentage": 20
      },
      {
        "Name": "C#",
        "RelevancePercentage": 20
      },
      {
        "Name": "Azure",
        "RelevancePercentage": 15
      },
      {
        "Name": "Web Services (WCF, REST, Web APIs)",
        "RelevancePercentage": 10
      },
      {
        "Name": "SQL",
        "RelevancePercentage": 10
      },
      {
        "Name": "Agile SCRUM",
        "RelevancePercentage": 5
      }
    ],
    "EssentialQualifications": [
      {
        "Name": "At least 4 years of Information Technology experience",
        "RelevancePercentage": 40
      },
      {
        "Name": "Bachelor’s degree or equivalent experience",
        "RelevancePercentage": 30
      },
      {
        "Name": "Located or willing to relocate to Burnaby",
        "RelevancePercentage": 20
      },
      {
        "Name": "Authorized to work in Canada without sponsorship",
        "RelevancePercentage": 10
      }
    ],
    "EssentialTechnicalSkillQualifications": [
      {
        "Name": "Experience in ASP .NET, .NET Core, C#",
        "RelevancePercentage": 30
      },
      {
        "Name": "Experience in Azure services",
        "RelevancePercentage": 25
      },
      {
        "Name": "Experience in Web Services (WCF, REST, Web APIs)",
        "RelevancePercentage": 20
      },
      {
        "Name": "Experience in Agile SCRUM Methodology",
        "RelevancePercentage": 15
      },
      {
        "Name": "Experience in SQL Programming and Profiling/Optimization",
        "RelevancePercentage": 10
      }
    ],
    "OtherTechnicalSkillQualifications": [
      {
        "Name": "Knowledge of Migration to .Net Core",
        "RelevancePercentage": 25
      },
      {
        "Name": "Knowledge of CI/CD toolset: VSO/TFS",
        "RelevancePercentage": 20
      },
      {
        "Name": "Understanding of Metadata-Driven Development models",
        "RelevancePercentage": 15
      },
      {
        "Name": "Power BI based development",
        "RelevancePercentage": 15
      },
      {
        "Name": "Logging and Telemetry",
        "RelevancePercentage": 15
      },
      {
        "Name": "Self-motivated and competent to work independently",
        "RelevancePercentage": 10
      }
    ],
    "SalaryOrBudgetOffered": "BC-$81575 to $116670",
    "Description": "The Senior .net full stack dev lead will drive the end-to-end software development lifecycle, including design, development, testing, and deployment. The role requires expertise in ASP .NET, .NET Core, C#, and Azure services. Candidates must have at least 4 years of IT experience and be located in or willing to relocate to Burnaby.",
    "Url": "https://www.linkedin.com/jobs/view/4234493090/",
    "RawJobDescription": [
      "About the job",
      "Job Description",
      "",
      "Infosys is seeking a Senior .net full stack dev lead who will play a key role for design, development, and end to end support for a development enhancement program with for one of the key clients.",
      "Required Qualifications",
      "Candidate must be located within commuting distance of Burnaby or be willing to relocate to the area. This position may require travel.",
      "Bachelor’s degree or foreign equivalent required from an accredited institution. Will also consider three years of progressive experience in the specialty in lieu of every year of education.",
      "At least 4 years of Information Technology experience.",
      "Candidates authorized to work for any employer in Canada without employer-based visa sponsorship are welcome to apply. Infosys is unable to provide immigration sponsorship for this role at this time.",
      "Preferred Skills",
      " Drive the end-to-end software development lifecycle, from requirements gathering and system design to implementation, testing, deployment, and maintenance.",
      " Full stack developer with good experience in design, development, testing and deployment of applications.",
      " Must have at least 5 years of Experience working in ASP .NET, .NET Core, C#, Generics, Delegates, Events",
      " Excellent in OOPs, SOLID Design principles and SDLC",
      " Excellent Problem Solving Analytical and Debugging Skills.",
      " Real experience working in N-Tier complex projects – web applications.",
      " Experience in Agile SCRUM Methodology",
      " Must have experience in Web Services – WCF, REST, Web APIs, ADO.NET",
      " Must have experience in Azure – Azure Managed Identity, Service Bus, App Services, Function Apps, WebApps",
      " Must have experience in developing UT framework Like Nunit, MSTest, Xunit",
      " Must have experience in team handling, managing quality for team deliverables.",
      "Preferred Qualifications",
      " Knowledge of Migration to .Net Core.",
      " Knowledge of SQL coding guidelines, best practices etc.",
      " Knowledge of CICD toolset: VSO/TFS",
      " On the Job Experience in Code Reviews using Visual Studio, Code Flow etc.",
      " Understanding of Metadata -Driven Development models, Multitenant Architecture.",
      " SQL Programming and Profiling/Optimization",
      " Power BI based development",
      " Logging and Telemetry",
      " Issue identification and Resolution",
      " Self-motivated and competent to work independently in complex environment.",
      "The job may also entail sitting as well as working at a computer for extended periods of time. Candidates should be able to effectively communicate by telephone, email, and face to face.",
      "Estimated annual compensation range for the candidate based in the below location will be: BC-$81575 to $116670"
    ]
  },
  {
    "Id": "4229315740",
    "CompanyName": "PressReader",
    "JobOfferTitle": "Senior Software Engineer",
    "JobOfferSummarize": "PressReader is seeking a Senior Software Engineer to join their Engineering Team. The role involves designing and developing key software components, delivering high-quality code, and collaborating with teammates. The ideal candidate has 5\u002B years of experience with .NET applications, C#, and SQL, and is proficient in building scalable systems.",
    "EmailContact": "people@pressreader.com",
    "ContactHiringSection": "Not provided",
    "KeySkillsRequired": [
      {
        "Name": "C#",
        "RelevancePercentage": 30
      },
      {
        "Name": ".NET",
        "RelevancePercentage": 25
      },
      {
        "Name": "SQL",
        "RelevancePercentage": 20
      },
      {
        "Name": "Docker/Kubernetes",
        "RelevancePercentage": 15
      },
      {
        "Name": "Micro-services",
        "RelevancePercentage": 10
      }
    ],
    "EssentialQualifications": [
      {
        "Name": "Minimum of 5 years\u0027 experience in developing .NET applications",
        "RelevancePercentage": 50
      },
      {
        "Name": "Proficient in crafting reliable and scalable software systems",
        "RelevancePercentage": 30
      },
      {
        "Name": "Mastery in building backend services using C# and SQL",
        "RelevancePercentage": 20
      }
    ],
    "EssentialTechnicalSkillQualifications": [
      {
        "Name": "Proven experience in constructing micro-services utilizing Docker/Kubernetes",
        "RelevancePercentage": 30
      },
      {
        "Name": "Proficiency in refactoring complex code to enhance testability and maintainability",
        "RelevancePercentage": 25
      },
      {
        "Name": "Knowledge or experience in test-driven development and agile/iterative development methodologies",
        "RelevancePercentage": 20
      },
      {
        "Name": "Exceptional communication skills, both written and verbal",
        "RelevancePercentage": 15
      },
      {
        "Name": "A team-player mindset with a willingness to broaden skills",
        "RelevancePercentage": 10
      }
    ],
    "OtherTechnicalSkillQualifications": [
      {
        "Name": "Experience with a modern front-end development framework (Angular, React, or Vue.js)",
        "RelevancePercentage": 70
      },
      {
        "Name": "Hold a Bachelor\u0027s Degree in Computer Science",
        "RelevancePercentage": 30
      }
    ],
    "SalaryOrBudgetOffered": "$110,000 to $130,000",
    "Description": "The Senior Software Engineer will design and develop key software components for PressReader applications, focusing on backend services with some frontend contributions. The role requires adherence to development best practices, peer reviews, and mentoring junior engineers. The ideal candidate has 5\u002B years of .NET experience, proficiency in C# and SQL, and strong communication skills.",
    "Url": "https://www.linkedin.com/jobs/view/4229315740/",
    "RawJobDescription": [
      "About the job",
      "PressReader is a rapidly growing technology company that partners with the world\u0027s leading publishers to deliver content to millions of users in over 160 countries. Our progressive approach to digital distribution has allowed publishers such as The Washington Post, The Guardian, Newsweek, Rolling Stone, The Globe and Mail, and Vogue to find new audiences through business partnerships, including airlines, hotels, cruise ships, libraries, and thousands of other companies worldwide.",
      "",
      "Our technology also powers Branded Editions (BE) - a white-label solution that enables publishers to deliver their digital content in interactive ways. BE allows them to build a customizable platform that supports a wide range of revenue opportunities.",
      "We have a full-time opportunity for a Senior Software Engineer to join our Engineering Team.",
      "As part of the Engineering team, you will work on an award-winning digital platform, and work across various stages of the software development cycle in a wide range of development projects. You will use your proven experience in .NET to heighten our current and future projects. You will help shape the culture and success of our Engineering department.",
      "This is a great opportunity for a developer who has about 5\u002B years of experience working with .NET applications as part of a professional team. Solid experience with C# and SQL is essential.",
      "In this role, you will:",
      "Design and develop key software components and services for PressReader applications, primarily focusing on the backend, but also contributing to the frontend as needed",
      "Deliver code with top-tier quality while adhering to development best practices, employing test-driven development methodologies, and supporting test automation",
      "Engage in estimating project efforts and timelines for delivery",
      "Take charge in conducting peer design and code reviews",
      "Identify technical, schedule, and other potential project risks, providing pertinent feedback",
      "Actively collaborate with teammates and maintain effective communication with project stakeholders to ensure smooth and predictable project progression",
      "Create and uphold high-caliber technical documentation outlining software designs and solutions",
      "Coach and/or mentor junior engineers on the team",
      "You may be a great fit if you have:",
      "Minimum of 5 years\u0027 experience in developing .NET applications",
      "Proficient in crafting reliable and scalable software systems",
      "Mastery in building backend services using C# and SQL. ",
      "Proven experience in constructing micro-services utilizing Docker/Kubernetes",
      "Proficiency in refactoring complex code to enhance testability and maintainability",
      "Knowledge or experience in test-driven development and agile/iterative development methodologies",
      "Exceptional communication skills, both written and verbal, coupled with strong interpersonal abilities",
      "A team-player mindset with a willingness to broaden skills and actively contribute ideas and knowledge",
      " Bonus points if you:",
      "Have experience with a modern front-end development framework (Angular, React, or Vue.js)",
      "Hold a Bachelor\u0027s Degree in Computer Science",
      "Why us for your next career adventure? ",
      "PressReader offers a hybrid work environment to balance the flexibility of working from home and being together to collaborate, celebrate, and connect. This position is based in our Richmond, BC office and requires to be on-premises three days a week. When not in the office, employees have the opportunity to work remotely.",
      "PressReader is committed to providing a fair compensation package which include a 100% employer-paid health, dental, and vision benefit plan; 15 paid vacation days to start; health and wellness days and bereavement days; reimbursements for professional training and membership in professional associations; fitness subsidy and more, along with a chance to be working with amazing people. The pay range for this role is $110,000 to $130,000, depending on experience.",
      "We thank everyone who is interested in our role. Only qualified candidates legally eligible to work in Canada will be directly contacted for this position.",
      "If you don\u0027t see yourself fully reflected in every job requirement listed for this job, we still encourage you to apply. We are committed to creating a more equitable, inclusive and diverse company and we welcome applicants of all genders, ages, ethnicities, cultures, abilities, sexual orientations, sexual identification, and life experiences. If you require accommodation in completing any pre-employment assessments or applications, interviewing, or otherwise participating in the recruitment process, please email people@pressreader.com.",
      "Finally, sometimes emergencies happen and you may need to reschedule an interview. We understand. Please let us know without worrying about losing the opportunity or your credibility.",
      "To apply, please submit your resume, and a cover letter explaining why you are the right person for this role.",
      "This is a great opportunity for the right candidate.",
      "We can\u0027t wait to meet you!"
    ]
  },
  {
    "Id": "4223264167",
    "CompanyName": "Comm100",
    "JobOfferTitle": "Senior Software Engineer(.Net)",
    "JobOfferSummarize": "The Senior Software Engineer(.Net) will design, build, and maintain backend APIs or services, write clean and high-quality code, and work closely with cross-regional teams. The role requires a Bachelor’s degree in computer science, 5\u002B years of experience, and proficiency in C#, .NET Core, ASP.NET Core, and SQL Server.",
    "EmailContact": "Not provided",
    "ContactHiringSection": "Not provided",
    "KeySkillsRequired": [
      {
        "Name": "C#",
        "RelevancePercentage": 25
      },
      {
        "Name": ".NET Core",
        "RelevancePercentage": 20
      },
      {
        "Name": "ASP.NET Core",
        "RelevancePercentage": 15
      },
      {
        "Name": "SQL Server",
        "RelevancePercentage": 15
      },
      {
        "Name": "Entity Framework",
        "RelevancePercentage": 10
      },
      {
        "Name": "Object-Oriented Design",
        "RelevancePercentage": 10
      },
      {
        "Name": "DevOps/CI/CD",
        "RelevancePercentage": 5
      }
    ],
    "EssentialQualifications": [
      {
        "Name": "5\u002B years of hands-on experience in application development",
        "RelevancePercentage": 50
      },
      {
        "Name": "Bachelor’s degree or above in computer science or software engineering",
        "RelevancePercentage": 30
      },
      {
        "Name": "Experience with large-scale, high concurrency web applications development",
        "RelevancePercentage": 20
      }
    ],
    "EssentialTechnicalSkillQualifications": [
      {
        "Name": "Proficient in C#, .Net Core, ASP.NET Core, Entity framework",
        "RelevancePercentage": 40
      },
      {
        "Name": "Proficient in SQL Server Database, including design and performance tuning",
        "RelevancePercentage": 30
      },
      {
        "Name": "In-depth knowledge of Object-Oriented Design and Domain Driven Design",
        "RelevancePercentage": 20
      },
      {
        "Name": "Familiarity with DevOps practices and CI/CD pipelines",
        "RelevancePercentage": 10
      }
    ],
    "OtherTechnicalSkillQualifications": [
      {
        "Name": "Good communication skills and teamwork spirit",
        "RelevancePercentage": 60
      },
      {
        "Name": "Passion for software development and new techniques",
        "RelevancePercentage": 40
      }
    ],
    "SalaryOrBudgetOffered": "$80,000 – 120,000 per year",
    "Description": "The Senior Software Engineer(.Net) will design, build, and maintain backend APIs or services, write clean and high-quality code, and work closely with cross-regional teams. The role requires a Bachelor’s degree in computer science, 5\u002B years of experience, and proficiency in C#, .NET Core, ASP.NET Core, and SQL Server.",
    "Url": "https://www.linkedin.com/jobs/view/4223264167/",
    "RawJobDescription": [
      "About the job",
      "Apply Now: Senior Software Engineer(.Net)",
      "",
      "Who We Are ",
      "Comm100 is an award-winning digital customer engagement platform, enabling organizations to better engage, convert and support their customers online. Established in 2009, Comm100 serves over 10,000 clients globally including HP, Rackspace, Government of Canada, Google, Stanford University, and many more. We believe that our work is never done as long as there are customers in a queue. We don’t sleep until we find the smartest, most efficient way to communicate, answer questions, and solve problems. ",
      "What We Believe ",
      "At Comm100, we strongly believe that the success of a company depends entirely on its people. We seek self-motivated team players who will appreciate a performance-driven work environment, rooted in creativity, personal development, integrity and open communication. We work hard but always make time for fun. ",
      " What We Offer ",
      "Competitive compensation",
      "Comprehensive benefits package ",
      "Flexible working environment and office hours ",
      "Quarterly fun and interactive team-building events ",
      "Opportunities for professional learning, growth, and career advancement ",
      "About the Role",
      "Job Responsibilities: ",
      " Design, build, and maintain backend APIs or Services based on the customer requirements and software specifications. ",
      " Writing clean, high-quality, high-performance, maintainable code with company common frameworks/libraries. ",
      " Document and illustrate solutions with clear code, diagrams, and documentation. ",
      " Writing clean, readable, and thoroughly tested code to ensure software reliability and maintainability. ",
      " Safeguard operations with secure coding practices and confidentiality. ",
      " Work closely with cross-regional engineering teams to facilitate communication and collaboration. ",
      " Support and mentor fellow engineers, providing guidance, coaching, and educational opportunities. ",
      " Engage in direct communication with customers and business stakeholders to propose technical solutions and address product issues. ",
      " Stay updated with the latest development tools and techniques, while expanding your knowledge through education, publications, and networking. ",
      " Job Requirements: ",
      " Bachelor’s degree or above in computer science or software engineering. ",
      " 5\u002B years of hands-on experience in application development. ",
      " Proficient in C#, .Net Core, C#, ASP.NET Core, Entity framework and visual studio IDE. ",
      " Proficient in SQL Server Database, including database design, database management and SQL statements analysis and performance tuning. ",
      " In-depth knowledge of Object-Oriented Design and design principles like Domain Driven Design. ",
      " Familiarity with DevOps practices and CI/CD pipelines. ",
      " Possesses a curious mindset, a passion for continuous learning, and strong problem-solving abilities. ",
      " Good communication skills and teamwork spirit. ",
      " Passion in software development, new techniques, and the ability to provide technical guidance to team members. ",
      " Experience with large-scale, high concurrency web applications development is a strong plus. ",
      "Salary: $80,000 – 120,000 per year",
      " Location: This position is a fully on-site role.",
      "We sincerely thank all applicants for their interest; however, only shortlisted candidates will be contacted. Applicants must be eligible to work in Canada."
    ]
  },
  {
    "Id": "4224847408",
    "CompanyName": "Comm100",
    "JobOfferTitle": "Software Engineer(.Net)",
    "JobOfferSummarize": "The Software Engineer(.Net) will design, build, and maintain backend APIs or Services, write clean and maintainable code, and collaborate with cross-regional teams. The role requires proficiency in C#, .NET Core, and SQL Server, along with strong problem-solving and communication skills.",
    "EmailContact": "Not provided",
    "ContactHiringSection": "Not provided",
    "KeySkillsRequired": [
      {
        "Name": "C#",
        "RelevancePercentage": 30
      },
      {
        "Name": ".NET Core",
        "RelevancePercentage": 25
      },
      {
        "Name": "ASP.NET Core",
        "RelevancePercentage": 20
      },
      {
        "Name": "Entity Framework",
        "RelevancePercentage": 15
      },
      {
        "Name": "SQL Server",
        "RelevancePercentage": 10
      }
    ],
    "EssentialQualifications": [
      {
        "Name": "Bachelor’s degree or above in computer science or software engineering",
        "RelevancePercentage": 40
      },
      {
        "Name": "2\u002B years of hands-on experience in application development",
        "RelevancePercentage": 40
      },
      {
        "Name": "Knowledge of Object-Oriented Design and design principles like Domain Driven Design",
        "RelevancePercentage": 20
      }
    ],
    "EssentialTechnicalSkillQualifications": [
      {
        "Name": "Proficient in C#, .Net Core, ASP.NET Core, Entity framework and visual studio IDE",
        "RelevancePercentage": 30
      },
      {
        "Name": "Familiar with SQL Server Database, including database design and performance tuning",
        "RelevancePercentage": 25
      },
      {
        "Name": "Experience with Frontend development with React, Vue, or AngularJS",
        "RelevancePercentage": 20
      },
      {
        "Name": "Writing clean, readable, and thoroughly tested code",
        "RelevancePercentage": 15
      },
      {
        "Name": "Secure coding practices",
        "RelevancePercentage": 10
      }
    ],
    "OtherTechnicalSkillQualifications": [
      {
        "Name": "Good communication skills and teamwork spirit",
        "RelevancePercentage": 70
      },
      {
        "Name": "Possesses a curious mindset and a passion for continuous learning",
        "RelevancePercentage": 30
      }
    ],
    "SalaryOrBudgetOffered": "$60,000 – 100,000 per year",
    "Description": "The Software Engineer(.Net) will design, build, and maintain backend APIs or Services, write clean and maintainable code, and collaborate with cross-regional teams. The role requires proficiency in C#, .NET Core, and SQL Server, along with strong problem-solving and communication skills.",
    "Url": "https://www.linkedin.com/jobs/view/4224847408/",
    "RawJobDescription": [
      "About the job",
      "Apply Now: Software Engineer(.Net)",
      "",
      "Who We Are",
      "Comm100 is an award-winning digital customer engagement platform, enabling organizations to better engage, convert and support their customers online. Established in 2009, Comm100 serves over 10,000 clients globally including HP, Rackspace, Government of Canada, Google, Stanford University, and many more. We believe that our work is never done as long as there are customers in a queue. We don’t sleep until we find the smartest, most efficient way to communicate, answer questions, and solve problems.",
      "What We Believe",
      "At Comm100, we strongly believe that the success of a company depends entirely on its people. We seek self-motivated team players who will appreciate a performance-driven work environment, rooted in creativity, personal development, integrity and open communication. We work hard but always make time for fun.",
      "What We Offer",
      "Competitive compensation",
      "Comprehensive benefits package ",
      "Flexible working environment and office hours ",
      "Quarterly fun and interactive team-building events ",
      "Opportunities for professional learning, growth, and career advancement ",
      "About The Role",
      "Job Responsibilities: ",
      "Design, build, and maintain backend APIs or Services based on the customer requirements and software specifications. ",
      "Writing clean, high-quality, high-performance, maintainable code with company common frameworks/libraries. ",
      "Document and illustrate solutions with clear code, diagrams, and documentation. ",
      "Writing clean, readable, and thoroughly tested code to ensure software reliability and maintainability. ",
      "Safeguard operations with secure coding practices and confidentiality. ",
      "Work closely with cross-regional engineering teams to facilitate communication and collaboration. ",
      "Engage in direct communication with customers and business stakeholders to propose technical solutions and address product issues. ",
      "Stay updated with the latest development tools and techniques, while expanding your knowledge through education, publications, and networking. ",
      "Job Requirements",
      "Bachelor’s degree or above in computer science or software engineering. ",
      "2\u002B years of hands-on experience in application development. ",
      "Proficient in C#, .Net Core, C#, ASP.NET Core, Entity framework and visual studio IDE. ",
      "Familiar with SQL Server Database, including database design, database management and SQL statements analysis and performance tuning. ",
      "Knowledge of Object-Oriented Design and design principles like Domain Driven Design. ",
      "Possesses a curious mindset, a passion for continuous learning, and good problem-solving abilities. ",
      "Good communication skills and teamwork spirit. ",
      "Experience with Frontend development with React, Vue, or AngularJS is a strong plus. ",
      "Salary: $60,000 – 100,000 per year",
      "Location: This position is a fully on-site role.",
      "We sincerely thank all applicants for their interest; however, only shortlisted candidates will be contacted. Applicants must be eligible to work in Canada."
    ]
  },
  {
    "Id": "4250559505",
    "CompanyName": "Corpay",
    "JobOfferTitle": "Senior Full .NET Stack Developer",
    "JobOfferSummarize": "Corpay is seeking a Senior Full .NET Stack Developer to provide technical direction and development expertise. The role involves working with C#, .NET, JavaScript, and other technologies to build and maintain applications. Responsibilities include debugging, collaborating with teams, and ensuring high-quality code. The ideal candidate will have extensive experience in full-stack development and a strong understanding of web protocols.",
    "EmailContact": "Not provided",
    "ContactHiringSection": "Not provided",
    "KeySkillsRequired": [
      {
        "Name": "C#",
        "RelevancePercentage": 30
      },
      {
        "Name": ".NET",
        "RelevancePercentage": 25
      },
      {
        "Name": "JavaScript",
        "RelevancePercentage": 15
      },
      {
        "Name": "ASP.NET",
        "RelevancePercentage": 10
      },
      {
        "Name": "React",
        "RelevancePercentage": 10
      },
      {
        "Name": "SQL Server",
        "RelevancePercentage": 10
      }
    ],
    "EssentialQualifications": [
      {
        "Name": "8\u002B years of experience using C#, Javascript and debugging techniques",
        "RelevancePercentage": 50
      },
      {
        "Name": "B.S./M.S. in Computer Science or equivalent experience",
        "RelevancePercentage": 30
      },
      {
        "Name": "Experience with .NET Full Framework (4.0–4.8) and .NET (2.2–7.0)",
        "RelevancePercentage": 20
      }
    ],
    "EssentialTechnicalSkillQualifications": [
      {
        "Name": "Expert in HTML/CSS/JavaScript and web protocols",
        "RelevancePercentage": 30
      },
      {
        "Name": "Experience with React/Redux/KnockoutJS",
        "RelevancePercentage": 25
      },
      {
        "Name": "SQL Server/MongoDB proficiency",
        "RelevancePercentage": 20
      },
      {
        "Name": "Knowledge of OOP, modular design, and CI/CD",
        "RelevancePercentage": 15
      },
      {
        "Name": "Scrum/Agile experience",
        "RelevancePercentage": 10
      }
    ],
    "OtherTechnicalSkillQualifications": [
      {
        "Name": "Strong communication skills",
        "RelevancePercentage": 70
      },
      {
        "Name": "Self-motivated and independent",
        "RelevancePercentage": 30
      }
    ],
    "SalaryOrBudgetOffered": "$110,000 -$125,000 CAD annually",
    "Description": "The Senior Full .NET Stack Developer will provide technical direction and development expertise, working with C#, .NET, JavaScript, and other technologies to build and maintain applications. Responsibilities include debugging, collaborating with teams, and ensuring high-quality code. The ideal candidate will have extensive experience in full-stack development and a strong understanding of web protocols.",
    "Url": "https://www.linkedin.com/jobs/view/4250559505/",
    "RawJobDescription": [
      "About the job"
    ]
  }
]